[
{"page_url": "http://classifieds.sunherald.com/ms/biloxi-foreclosures/state-of-mississippi-county-of/C0A801551657c03C9FqKg2417DEA", "text": "\n\t\tSTATE OF MISSISSIPPI COUNTY OF HARRISON SUBSTITUTE TRUSTEE'S NOTICE OF SALE WHEREAS, E. Ken Shaddix, being indebted to Hancock Bank, executed a Deed of Trust to Harry R. Allen, Trustee, for the benefit of Hancock Bank dated December 14, 2001 and recorded in the Record of Mortgages and Deeds of Trust on Land in Book 2343, Pages 83-89 in the office of the Chancery Clerk of the First Judicial District of Harrison County, Mississippi on December 17, 2001 as Instrument No. 2001 21562T; as modified per that Modification of Deed of Trust executed by E. Ken Shaddix dated June 26, 2003 and recorded in Book 2685, Pages 18-19 on July 25, 2003 as Instrument No. 2003 0014700T; as further modified per that Modification of Deed of Trust executed by E. Ken Shaddix and Earl K. Shaddix dated June 10, 2005 and recorded on August 4, 2008 as Instrument No. 2008 11327T-J1; as further modified per that Modification of Deed of Trust executed by E. Ken Shaddix dated November 26, 2010 and recorded on December 8, 2010 as Instrument No. 2010 12369T-J1 (the \"Deed of Trust\"); and WHEREAS, Whitney Bank, a Mississippi state chartered bank, formerly Hancock Bank, a Mississippi state chartered bank, is the present owner and holder of deed of trust and has substituted John M. Harral, as Substitute Trustee therein, as authorized by the terms of said Deed of Trust, by instrument dated October 8, 2015, and recorded on October 13, 2015 as Instrument No. 2015 9814T-J1 of the aforesaid land records; and WHEREAS, default having been made in the terms and conditions of the Deed of Trust and the entire debt secured thereby having become due and payable in accordance with the terms of the indebtedness and the Deed of Trust, and the legal owner and holder of said indebtedness, Hancock Bank, having requested the undersigned Substitute Trustee to execute the trust and sale of the land and property described in the Deed of Trust and in accordance with the terms of the Deed of Trust for the purpose of raising the sums due thereunder, together with attorney's fees, Substitute Trustee's fees and expenses of sale; NOW, THEREFORE, notice is hereby given that I, John M. Harral, Substitute Trustee in the Deed of Trust, will on Friday, the 7th day of October, 2016, offer for sale and will sell at public sale and outcry, to the highest and best bidder for cash during legal hours at the East front door of the Harrison County Courthouse in Gulfport, Mississippi, the following described real property situated and lying in the First Judicial District of Harrison County, State of Mississippi; to wit: Lots 2, 3, 4, 5, 6, 9, 10, 11 and 12 and the East 5 feet of Lots 7 and 8 in Block 13 of Kohler & Russell Subdivision of the City of Long Beach, Mississippi, according to the plat thereof of record in Book 4, Page 8 (Copy Book 2A, Page 134) of the Plat Records of Harrison County, Mississippi, in the First Judicial District. I WILL CONVEY only such title as is vested in me as Substitute Trustee, this sale being subject to any and all liens and other encumbrances having priority over the Deed of Trust. WITNESS MY SIGNATURE this the 12th day of September, 2016. /s/ John M. Harral John M. Harral, Substitute Trustee Publish: September 15, 2016 September 22, 2016 September 29, 2016 October 6, 2016 POSTED: Harrison County Courthouse Gulfport, Mississippi On or before the 15th day of September, 2016 1580804\n\t"},
{"page_url": "http://classifieds.sunherald.com/ms/biloxi-foreclosures/substituted-trustees-notice-o/C0A801541651803C9DyIy38896DD", "text": "\n\t\tSUBSTITUTED TRUSTEE'S NOTICE OF SALE WHEREAS, on May 28, 1998, Mary A. President and Alvin C. Johnson, executed a certain deed of trust to D.J. Horecky, Trustee for the benefit of Bridges Mortgage Company, Inc. which deed of trust is of record in the office of the Chancery Clerk of Jackson County, State of Mississippi in Book 1481 at Page 600; and WHEREAS, said Deed of Trust was subsequently assigned to Wells Fargo Bank, N.A. by instrument dated April 12, 2007 and recorded in Book 2572 at Page 33 of the aforesaid Chancery Clerk's office; and WHEREAS, Wells Fargo Bank, N.A. has heretofore substituted Shapiro & Massey, LLC as Trustee by instrument dated August 19, 2016 and recorded in the aforesaid Chancery Clerk's Office in Book 3379 at Page 461; and WHEREAS, default having been made in the terms and conditions of said deed of trust and the entire debt secured thereby having been declared to be due and payable in accordance with the terms of said deed of trust, Wells Fargo Bank, N.A., the legal holder of said indebtedness, having requested the undersigned Substituted Trustee to execute the trust and sell said land and property in accordance with the terms of said deed of trust and for the purpose of raising the sums due thereunder, together with attorney's fees, trustee's fees and expense of sale. NOW, THEREFORE, I, Shapiro & Massey, LLC, Substituted Trustee in said deed of trust, will on October 5, 2016 offer for sale at public outcry and sell within legal hours (being between the hours of 11:00 a.m. and 4:00 p.m.), at the Main West Front Door of the County Courthouse of Jackson County, located at Pascagoula, Mississippi, to the highest and best bidder for cash the following described property situated in Jackson County, State of Mississippi, to-wit: Lot 21, Lenda-Lynn Subdivision, Pascagoula, Jackson County, Mississippi, as per plat thereof recorded in Plat Book 12, Page 26, Records of Plats on file in the office of the Chancery Clerk of Jackson County, Mississippi. I WILL CONVEY only such title as vested in me as Substituted Trustee. WITNESS MY SIGNATURE on this 8th day of September, 2016. Shapiro & Massey, LLC SUBSTITUTED TRUSTEE Shapiro & Massey, LLC 1080 River Oaks Drive Suite B-202 Flowood, MS 39232 (601) 981-9299 4203 Lambert Court Pascagoula, MS 39581 16-017136GW Publication Dates: September 14, 21, 28, 2016 1580734\n\t"},
{"page_url": "http://classifieds.sunherald.com/ms/biloxi-foreclosures/substituted-trustees-notice-o/C0A801541651803C9DiLp38896DD", "text": "\n\t\tSUBSTITUTED TRUSTEE'S NOTICE OF SALE WHEREAS, on March 30, 2007, Anthony Hyde and Priscilla Hyde, husband and wife executed a certain deed of trust to Arnold M. Weiss, Trustee for the benefit of Mortgage Electronic Registration Systems, Inc. as nominee for Homecomings Financial, LLC (f/k/a Homecomings Financial Network, Inc.), its successors and assigns which deed of trust is of record in the office of the Chancery Clerk of Jackson County, State of Mississippi in Book 2563 at Page 827; and WHEREAS, said Deed of Trust was subsequently assigned to Ditech Financial LLC by instrument dated May 16, 2016 and recorded in Book 3377 at Page 622 of the aforesaid Chancery Clerk's office; and WHEREAS, Ditech Financial, LLC. has heretofore substituted Shapiro & Massey, LLC as Trustee by instrument dated July 22, 2016 and recorded in the aforesaid Chancery Clerk's Office in Book 3377 at Page 624; and WHEREAS, default having been made in the terms and conditions of said deed of trust and the entire debt secured thereby having been declared to be due and payable in accordance with the terms of said deed of trust, Ditech Financial, LLC., the legal holder of said indebtedness, having requested the undersigned Substituted Trustee to execute the trust and sell said land and property in accordance with the terms of said deed of trust and for the purpose of raising the sums due thereunder, together with attorney's fees, trustee's fees and expense of sale. NOW, THEREFORE, I, Shapiro & Massey, LLC, Substituted Trustee in said deed of trust, will on October 5, 2016 offer for sale at public outcry and sell within legal hours (being between the hours of 11:00 a.m. and 4:00 p.m.), at the Main West Front Door of the County Courthouse of Jackson County, located at Pascagoula, Mississippi, to the highest and best bidder for cash the following described property situated in Jackson County, State of Mississippi, to-wit: Commencing at the intersection of the North line of said Section 1, with the East rightof-way line of Mississippi State Highway No. 63, run South 15 degrees 52' East along the East right-of-way line of said Highway 2289.3 feet to its intersection with the North line of Barlow Street; thence North 88 degrees 48' East along the North line of Barlow Street 260 feet to the Point of Beginning of the property herein described, and from said Point of Beginning, run North 01 degrees 12' West 100 feet to a point; thence North 88 degrees 48' East 83.3 feet to a point; thence South 01 degrees 12' East 100 feet to a point on the North line of Barlow Street; thence South 88 degrees 48' West along the North line of Barlow Street 83.9 feet to the Point of Beginning. This being the same land conveyed to Sam Sanderford and wife, Betty Sanderford by Warranty Deed dated June 22, 1979 and recorded in Deed Book 651 at Page 201, Land Deed Records of Jackson County, Mississippi. Indexing Instructions: S1, T7S, R6W, Jackson Co., Mississippi I WILL CONVEY only such title as vested in me as Substituted Trustee. WITNESS MY SIGNATURE on this 6th day of September, 2016. Shapiro & Massey, LLC SUBSTITUTED TRUSTEE Shapiro & Massey, LLC 1080 River Oaks Drive Suite B-202 Flowood, MS 39232 (601) 981-9299 4201 Knowlcrest Drive Moss Point, MS 39562 16-015790AH Publication Dates: September 14, 21 and 28, 2016 1580692\n\t"},
{"page_url": "http://classifieds.sunherald.com/ms/biloxi-foreclosures/substitute-trustees-notice-of/C0A801541651803C9DNYj38896DD", "text": "\n\t\tSUBSTITUTE TRUSTEE'S NOTICE OF FORECLOSURE SALE WHEREAS, on October 23, 2006, Donald W Patton and Tamera A Patton executed a certain deed of trust to Emmet James House or Bill R. McLaughlin, Trustee for the use and benefit of Regions Bank d/b/a Regions Mortgage, which deed of trust is of record in the office of the Chancery Clerk of Harrison, County, state of Mississippi, in Instrument Number, 2006 23827 T-J1; and WHEREAS, Regions Bank, the current holder and/or assignee, substituted Jauregui & Lindsey as Trustee by instrument recorded in the Chancery Clerk's Office on August 22, 2016 in Instrument #, 2 016-7077 -T-J1; and WHEREAS, Default having been made in the terms and conditions of said deed of trust and the entire debt secured thereby having been declared to be due and payable in accordance with the terms of said deed of trust, Regions Bank, the legal holder of said indebtedness, having requested the undersigned Substitute Trustee in said deed of trust, will on October 6, 2016 offer for sale at public outcry and sell within legal hours (being between the hours of 11:00 a.m. and 4:00 p.m.), at the main front door of the County Courthouse of Harrison County in Gulfport, Mississippi, to the highest and best bidder for cash the following described property situated in Harrison County, Mississippi, to wit: Legal description of the land: FIRST STONE COUNTY, MISSISSIPPI TOWNSHIP 4 SOUTH, RANGE 13 WEST SECTION 35 & 36 A PARCEL OF LAND SITUATED IN THE SOUTH 1/2 OF THE SOUTH 1/2 OF SECTION 36, TOWNSHIP 4 SOUTH, RANGE 13 WEST, STONE COUNTY, MISSISSIPPI, AND ALSO IN THE SOUTH 1/2; OF THE SOUTHEAST 1/4 OF SECTION 35 TOWNSHIP 4 SOUTH, RANGE 13 WEST, STONE COUNTY, MISSISSIPPI, BEING MORE PARTICULARLY DESCRIBED AS FOLLOWS: BEGINNING AT A CONCRETE MONUMENT AT THE SOUTHEAST CORNER OF SECTION 35, TOWNSHIP 4 SOUTH, RANGE 13 WEST, STONE COUNTY, MISSISSIPPI; THENCE ALONG THE NORTH LINE OF SAID SECTION 35, NORTH 89 DEGREES 54 MINUTES 27 SECTIONS WEST, 1700.37 FEET TO A POINT AT A 10 FOOT OFFSET FROM THE EAST EDGE OF AN EXISTING DITCH BANK; THENCE ALONG SAID 10 FOOT OFFSET FROM THE EAST EDGE OF AN EXISTING DITCH BANK THE FOLLOWING COURSES; NORTH 24 DEG. 50 MIN. 11 SEC. EAST, 29.85 FEET TO AN IRON ROD; THENCE NORTH 17 DEG. 20 MIN. 22 SEC. EAST, 49.94 FEET TO AN IRON ROD; THENCE NORTH 06 DEG. 21 MIN. 10 SEC. EAST, 54.72 FEET TO AN IRON ROD; THENCE NORTH 05 DEG. 47 MIN. 32 SEC. WEST, 93.49 FEET TO AN IRON ROD; THENCE NORTH 11 DEG. 04 MIN. 05 SEC. EAST, 79.25 FEET TO AN IRON ROD LYING 300 FEET NORTH OF THE SOUTH LINE OF SECTION 35, TOWNSHIP 4 SOUTH, RANGE 13 WEST, STONE COUNTY, MISSISSIPPI, THENCE SOUTH 89 DEG. 54 MIN. 27 SEC. EAST, 3920.38 FEET TO AN IRON ROD SET AT A 10 FOOT OFFSET FROM THE EAST EDGE OF AN EXISTING DITCH BANK; THENCE ALONG SAID 10 FOOT OFFSET FROM AN EXISTING DITCH BANK THE FOLLOWING COURSES: NORTH 20 DEG. 32 MIN. 29 SEC. EAST, 153.58 FEET TO AN IRON ROD; THENCE NORTH 21 DEG. 46 MIN. 29 SEC. EAST, 55.24 FEET TO AN IRON ROD; THENCE NORTH 34 DEG. 44 MIN. 44 SEC, EAST, 67.09 FEET TO AN IRON ROD; THENCE NORTH 48 DEG 59 MIN. 35 SEC. EAST, 71.52 FEET TO AN IRON ROD; THENCE NORTH 55 DEG. 07 MIN. 18 SEC. EAST, 73.14 FEET TO AN IRON ROD; THENCE NORTH 68 DEG. 24 MN. 48 SEC. EAST, 50.34 FEET TO AN IRON ROD; THENCE NORTH 79 DEG. 53 MIN. 45 SEC. EAST, 49.36 FEET TO AN IRON ROD; THENCE NORTH 88 DEG. 25 MIN. 53 SEC. EAST, 88.66 FEET TO AN IRON ROD; THENCE SOUTH 80 DEG. 40 MIN. 45 SEC. EAST, 119.23 FEET TO AN IRON ROD; THENCE SOUTH 70 DEG. 34 MIN. 27 SEC. EAST, 120.78 FEET TO AN IRON ROD; THENCE SOUTH 60 DEG. 07 MIN. 02 SEC. EAST, 385.36 FEET TO AN IRON ROD; THENCE SOUTH 54 DEG. 44 MIN. 52 SEC. EAST, 93.15 FEET TO AN IRON ROD; THENCE SOUTH 52 DEG. 54 MIN. 28 SEC. EAST, 113.14 FEET TO AN IRON ROD; THENCE SOUTH 60 DEG. 44 MIN. 34 SEC. EAST, 97.24 FEET TO AN IRON ROD; THENCE SOUTH 67 DEG. 51 MIN. 36 SEC. EAST, 88.85 FEET TO AN IRON ROD; THENCE SOUTH 71 DEG. 06 MIN. 31 SEC. EAST, 72.21 FEET TO AN IRON ROD; THENCE SOUTH 84 DEG, 21 MIN. 38 SEC. EAST, 74.93 FEET TO AN IRON ROD; THENCE SOUTH 89 DEG. 41 MIN. 14 SEC. EAST, 282.87 FEET TO AN IRON ROD; THENCE. SOUTH 89 DEG. 26 MIN. 20 SEC. EAST, 72.08 FEET TO AN IRON ROD; THENCE SOUTH 78 DEG. 08 MIN. 01 SEC. EAST, 76.11 FEET TO AN IRON ROD; THENCE SOUTH 52 DEG. 42 MIN. 51 SEC. EAST, 53.21 FEET TO AN IRON ROD; THENCE SOUTH 39 DEG. 44 MIN. 54 SEC. EAST, 71.60 FEET TO AN IRON ROD; THENCE SOUTH 24 DEG. 58 MIN. 14 SEC. EAST, 44.13 FEET TO AN IRON ROD; THENCE SOUTH 12 DEG. 56 MIN. 33 SEC. EAST, 42.48 FEET TO A POINT ON THE SOUTH LINE OF SECTION 36, TOWNSHIP 4 SOUTH, RANGE 13 WEST, STONE COUNTY, MISSISSIPPI; THENCE ALONG SAID SOUTH LINE OF SECTION 36, NORTH 89 DEG, 54 MIN. 27 SEC. WEST, 4257.61 FEET TO THE POINT OF BEGINNING 45.04 ACS. SECOND, HARRISON COUNTY, MISSISSIPPI TOWNSHIP 5 SOUTH, RANGE 12 WEST SECTION 6 AND TOWNSHIP 5 SOUTH, RANGE 13 WEST SECTION 1 & 2: A PARCEL OF LAND SITUATED IN SECTION 1, TOWNSHIP 5 SOUTH, RANGE 13 WEST, HARRISON COUNTY, MISSISSIPPI, AND ALSO IN THE EAST OF SECTION 2, TOWNSHIP 5 SOUTH, RANGE 13 WEST, HARRISON COUNTY, MISSISSIPPI, AND ALSO IN THE SOUTHWEST OF THE NORTHWEST 1/4 AND THE NORTHWEST 1/4 OF THE SOUTHWEST 1/4 OF SECTION 6, TOWNSHIP 5 SOUTH, RANGE 12 WEST, HARRISON COUNTY, MISSISSIPPI, BEING MORE PARTICULARLY DESCRIBED AS FOLLOWS: BEGINNING AT A LIGHTARD KNOT FOUND AT THE SOUTHEAST CORNER OF SECTION 2, TOWNSHIP 5 SOUTH, RANGE 13 WEST, HARRISON COUNTY, MISSISSIPPI; THENCE ALONG THE SOUTH LINE OF SECTION 2, NORTH 89 DEG. 44 MIN. 14 SEC. WEST, 743.77 FEET TO AN IRON ROD SET A AT 10 FOOT OFFSET FROM THE EAST EDGE OF AN EXISTING DITCH BANK; THENCE ALONG SAID 10 FOOT OFFSET FROM THE EAST EDGE OF AN EXISTING DITCH BANK THE FOLLOWING COURSES: NORTH 28 DEG. 14 MIN 31 SEC. WEST, 122.78 FEET TO AN IRON ROD; THENCE NORTH 30 DEG. 26 MIN. 39 SEC. WEST, 85.22 FEET TO AN IRON ROD; THENCE NORTH 29 DEG. 25 MIN. 01 SEC. WEST, 175.54 FEET TO AN IRON ROD; THENCE NORTH 31 DEG. 43 MIN. 56 SEC. WEST, 286.21 FEET TO AN IRON ROD; THENCE NORTH 28 DEG. 05 MIN. 23 SEC. WEST, 62.26 FEET TO AN IRON ROD; THENCE NORTH 18 DEG. 58 MIN. 15 SEC. WEST, 35.43 FEET TO AN IRON ROD; THENCE NORTH 03 DEG. 23 MIN. 10 SEC. WEST, 44.76 FEET TO AN IRON ROD; THENCE NORTH 02 DEG. 41 MIN. 00 SEC. EAST, 57.00 FEET TO AN IRON ROD; THENCE NORTH 05 DEG. 57 MIN. 36 SEC, EAST, 116.32 FEET TO AN IRON ROD; THENCE NORTH 04 DEG. 07 MIN. 42 SEC. EAST, 95.68 FEET TO AN IRON ROD; THENCE NORTH 01 DEG. 28 MIN. 23 SEC. WEST, 88.49 FEET TO AN IRON ROD; THENCE NORTH 14 DEG. 06 MIN. 23 SEC. WEST, 63.57 FEET TO AN IRON ROD; THENCE NORTH 19 DEG. 01 MIN. 22 SEC. WEST, 214.48 FEET TO AN IRON ROD; THENCE NORTH 24 DEG. 27 MIN. 40 SEC. WEST, 113.27 FEET TO AN IRON ROD; THENCE NORTH 45 DEG. 59 MIN. 38 SEC. WEST, 73.10 FEET TO AN IRON ROD; THENCE NORTH 56 DEG. 54 MIN. 20 SEC, WEST, 158.05 FEET TO AN IRON ROD; THENCE NORTH 54 DEG. 57 MIN 59 SEC. WEST, 85.66 FEET TO AN IRON ROD; THENCE NORTH 51 DEG. 29 MIN. 27 SEC. WEST, 88.69 FEET TO AN IRON ROD; THENCE NORTH 44 DEG. 00 MIN. 04 SEC. WEST, 102.99 FEET TO AN IRON ROD; THENCE NORTH 35 DEG. 30 MIN 57 SEC. WEST, 86.06 FEET TO AN IRON ROD; THENCE NORTH 27 DEG. 03 MIN. 52 SEC. WEST, 41.51 FEET TO AN IRON ROD; THENCE NORTH 17 DEG. 36 MIN. 14 SEC. WEST, 43.48 FEET TO AN IRON ROD; THENCE NORTH 01 DEG. 20 MIN. 44 SEC, EAST, 49.29 FEET TO AN IRON ROD; THENCE NORTH 22 DEG. 47 MIN. 09 SEC. EAST, 60.29 FEET TO AN IRON ROD; THENCE NORTH 29 DEG. 19 MIN. 02 SEC. EAST, 114.72 FEET TO AN IRON ROD; THENCE NORTH 32 DEG. 37 MIN. 49 SEC. EAST, 80.50 FEET TO AN IRON ROD; THENCE NORTH 38 DEG. 29 MIN. 48 SEC. EAST, 110.30 FEET TO AN IRON ROD; THENCE NORTH 40 DEG. 12 MIN. 06 SEC. EAST, 143.81 FEET TO AN IRON ROD; THENCE NORTH 35 DEG. 37 MIN. 13 SEC. EAST, 39.78 FEET TO AN IRON ROD; THENCE NORTH 27 DEG. 30 MIN. 32 SEC. EAST, 34.97 FEET TO AN IRON ROD; THENCE NORTH 17 DEG. 34 MIN. 03 SEC. EAST, 42.63 FEET TO AN IRON ROD; THENCE NORTH 14 DEG. 30 MIN. 55 SEC. EAST, 90.88 FEET TO AN IRON ROD; THENCE NORTH 05 DEG. 49 MIN. 57 SEC. EAST, 158.47 FEET TO AN IRON ROD; THENCE NORTH 02 DEG. 20 MIN. 58 SEC. EAST, 139.53 FEET TO AN IRON ROD; THENCE NORTH 13 DEG. 47 MIN. 13 SEC. EAST, 134.50 FEET TO AN IRON ROD; THENCE NORTH 26 DEG. 38 MIN. 18 SEC. EAST, 306.64 FEET TO AN IRON ROD; THENCE NORTH 30 DEG. 06 MIN. 26 SEC. EAST, 388.35 FEET TO AN IRON ROD; THENCE NORTH 23 DEG. 33 MIN. 57 SEC. EAST, 82.14 FEET TO AN IRON ROD; THENCE NORTH 24 DEG. 17 MIN. 52 SEC. EAST, 85.70 FEET TO AN IRON ROD; THENCE NORTH 20 DEG. 01 MIN. 47 SEC. EAST, 72.06 FEET TO AN IRON ROD; THENCE NORTH 07 DEG. 20 MIN. 14 SEC. EAST, 115.33 FEET TO AN IRON ROD; THENCE NORTH 22 DEG. 30 MIN. 23 SEC. EAST, 47.44 FEET TO AN IRON ROD; THENCE NORTH 27 DEG. 18 MIN. 03 SEC. EAST, 49.99 FEET TO AN IRON ROD; THENCE NORTH 63 DEG. 04 MIN. 25 SEC, WEST, 866.23 FEET TO AN IRON ROD; THENCE NORTH 62 DEG. 44 MIN. 48 SEC. WEST, 135.39 FEET TO AN IRON ROD; THENCE NORTH 57 DEG. 47 MIN. 43 SEC. WEST, 91.84 FEET TO AN IRON ROD; THENCE NORTH 50 DEG. 33 MIN. 31 SEC. WEST, 70.98 FEET TO AN IRON ROD; THENCE NORTH 41 DEG. 30 MIN. 38 SEC. WEST, 91.45 FEET TO AN IRON ROD; THENCE NORTH 32 DEG. 55 MIN. 55 SEC. WEST, 80.26 FEET TO AN IRON ROD; THENCE NORTH 22 DEG. 49 MIN. 28 SEC. WEST, 93.01 FEET TO AN IRON ROD; THENCE NORTH 17 DEG. 53 MIN. 11 SEC. WEST, 55.10 FEET TO AN IRON ROD; THENCE NORTH 03 DEG. 04 MIN. 34 SEC. WEST, 40.46 FEET TO AN IRON ROD; THENCE NORTH 15 DEG. 06 MIN. 04 SEC. EAST, 65.82 FEET TO AN IRON ROD; THENCE NORTH 26 DEG. 38 MIN. 20 SEC. EAST, 47.08 FEET TO AN IRON ROD; THENCE NORTH 38 DEG. 45 MIN. 43 SEC. EAST, 398.66 FEET TO AN IRON ROD; THENCE NORTH 24 DEG. 50 MIN. 11 SEC. EAST, 30.69 FEET TO A POINT ON THE NORTH LINE OF SECTION 2, TOWNSHIP 5 SOUTH, RANGE 13 WEST, HARRISON COUNTY, MISSISSIPPI; THENCE ALONG SAID NORTH LINE, SOUTH 89 DEG. 54 MIN 27 SEC. EAST, 1700.37 FEET TO A CONCRETE MONUMENT AT THE NORTHWEST CORNER OF SECTION 1, TOWNSHIP 5 SOUTH, RANGE 13 WEST, HARRISON COUNTY, MISSISSIPPI; THENCE ALONG THE NORTH LINE OF SAID SECTION 1, SOUTH 89 DEG. 54 MIN. 27 SEC. EAST, 4257.61 FEET TO A POINT AT A 10 FOOT OFFSET FROM THE WEST EDGE OF AN EXISTING DITCH BANK THE FOLLOWING COURSES: SOUTH 12 DEG. 56 MIN. 33 SEC. EAST, 125 FEET TO AN IRON ROD; THENCE SOUTH 18 DEG. 49 MIN, 39 SEC, EAST, 69.34 FEET TO AN IRON ROD; THENCE SOUTH 31 DEG, 04 MIN. 47 SEC. EAST, 64.38 FEET TO AN IRON ROD; THENCE SOUTH 64 DEG. 24 MIN. 18 SEC. EAST, 46.94 FEET TO AN IRON ROD; THENCE SOUTH 84 DEG. 30 MIN. 51 SEC. EAST, 149.13 FEET TO AN IRON ROD; THENCE SOUTH 76 DEG. 33 MIN. 54 SEC. EAST, 70.38 FEET TO AN IRON ROD; THENCE SOUTH 61 DEG. 23 MIN. 16 SEC. EAST 33.80 FEET TO AN IRON ROD; THENCE SOUTH 44 DEG. 41 MIN. 24 SEC. EAST, 42.48 FEET TO AN IRON ROD; THENCE SOUTH 29 DEG. 26 MIN. 03 SEC. EAST, 62.70 FEET TO AN IRON ROD; THENCE SOUTH 08 DEG. 25 MIN. 23 SEC. EAST, 50.47 FEET TO AN IRON ROD; THENCE SOUTH 12 DEG. 34 MIN. 54 SEC. EAST, 82.26 FEET TO AN IRON ROD; THENCE SOUTH 11 DEG. 34 MIN. 49 SEC. EAST, 90.69 FEET TO AN IRON ROD; THENCE SOUTH 19 DEG. 16 MIN. 54 SEC. EAST. 112.41 FEET TO AN IRON ROD; THENCE SOUTH 20 DEG. 04 MIN. 01 SEC. EAST, 92.96 FEET TO AN IRON ROD; THENCE SOUTH 18 DEG. 13 MIN. 00 SEC. EAST, 189.53 FEET TO AN IRON ROD; THENCE SOUTH 10 DEG. 33 MIN. 44 SEC. EAST, 79.89 FEET TO AN IRON ROD; THENCE SOUTH 03 DEG. 51 MIN. 58 SEC. EAST, 41.97 FEET TO AN IRON ROD; THENCE SOUTH 03 DEG. 08 MIN. 32 SEC. WEST, 30.52 FEET TO AN IRON ROD; THENCE SOUTH 14 DEG. 40 MIN. 27 SEC. WEST, 54.22 FEET TO AN IRON ROD; THENCE SOUTH 20 DEG. 19 MIN. 24 SEC, WEST, 62.44 FEET TO AN IRON ROD; THENCE SOUTH 28 DEG. 17 MIN. 28 SEC. WEST, 420.04 FEET TO AN IRON ROD; THENCE SOUTH 35 DEG. 10 MIN. 29 SEC. WEST, 86.31 FEET TO AN IRON ROD; THENCE SOUTH 33 DEG. 01 MIN. 11 SEC. WEST, 75.30 FEET TO AN IRON ROD; THENCE SOUTH 26 DEG. 20 MIN. 16 SEC. WEST, 55.18 FEET TO AN IRON ROD; THENCE SOUTH 54 DEG. 48 MIN. 47 SEC. EAST, 33.64 FEET TO AN IRON ROD; THENCE SOUTH 26 DEG. 32 MIN. 15 SEC. EAST, 54.38 FEET TO AN IRON ROD; THENCE SOUTH 54 DEG. 48 MIN. 47 SEC. EAST, 72.30 FEET TO AN IRON ROD; THENCE SOUTH 66 DEG. 04 MIN. 04 SEC. EAST, 74.05 FEET TO AN IRON ROD; THENCE SOUTH 74 DEG. 17 MIN. 51 SEC. EAST, 189.29 FEET TO AN IRON ROD; THENCE SOUTH 72 DEG. 56 MIN. 01 SEC. EAST, 237.81 FEET TO AN IRON ROD; THENCE SOUTH 75 DEG. 35 MIN. 49 SEC. EAST, 112.55 FEET TO AN IRON ROD; THENCE SOUTH 74 DEG. 33 MIN. 13 SEC. EAST, 84.24 FEET TO AN IRON ROD; THENCE SOUTH 65 DEG. 16 MIN. 03 SEC. EAST, 53.51 FEET TO AN IRON ROD; THENCE SOUTH 46 DEG. 03 MIN. 32 SEC. EAST, 38.05 FEET TO AN IRON ROD; THENCE SOUTH 16 DEG. 10 MIN. 41 SEC. EAST, 39.75 FEET TO AN IRON ROD; THENCE SOUTH 06 DEG. 14 MIN. 05 SEC. EAST, 47.67 FEET TO AN IRON ROD; THENCE SOUTH 03 DEG. 25 MIN. 42 SEC, EAST, 230.03 FEET TO AN IRON ROD; THENCE SOUTH 01 DEG. 57 MIN. 55 SEC, EAST, 229.34 FEET TO AN IRON ROD; THENCE SOUTH 13 DEG. 47 MIN. 25 SEC, EAST, 59.94 FEET TO AN IRON ROD; THENCE SOUTH 27 DEG. 46 MIN. 14 SEC. EAST, 53.14 FEET TO AN IRON ROD; THENCE SOUTH 30 DEG. 14 MIN. 59 SEC. EAST, 109.00 FEET TO AN IRON ROD; THENCE SOUTH 29 DEG. 51 MIN. 05 SEC, EAST, 103.75 FEET TO AN IRON ROD; THENCE SOUTH 29 DEG. 02 MIN. 04 SEC. EAST, 225.80 FEET TO AN IRON ROD; THENCE SOUTH 32 DEG. 28 MIN. 08 SEC. EAST, 236.73 FEET TO AN IRON ROD; THENCE SOUTH 30 DEG. 49 MIN. 50 SEC. EAST, 71.17 FEET TO AN IRON ROD; THENCE SOUTH 19 DEG. 12 MIN. 46 SEC. EAST, 52.80 FEET TO AN IRON ROD; THENCE SOUTH 14 DEG. 57 MIN, 10 SEC. EAST, 91.30 FEET TO AN IRON ROD; THENCE SOUTH 05 DEG. 25 MIN. 31 SEC. WEST, 43.85 FEET TO AN IRON ROD ON THE NORTH MARGIN OF MCHENRY ROAD; THENCE ALONG SAID NORTH MARGIN OF MCHENRY ROAD THE FOLLOWING COURSE; SOUTH 83 DEG. 22 MIN. 26 SEC. WEST, 110.11 FEET TO AN IRON ROD; THENCE SOUTH 80 DEG. 25 MIN. 47 SEC, WEST 110.67 FEET TO AN IRON ROD; THENCE SOUTH 58 DEG. 21 MIN. 06 SEC. WEST, 148.06 FEET TO AN IRON ROD; THENCE SOUTH 54 DEG. 18 MIN, 29 SEC. WEST, 271.10 FEET TO AN IRON ROD; THENCE SOUTH 45 DEG. 15 MIN. 34 SEC. WEST, 172.77 FEET TO AN IRON ROD; THENCE SOUTH 29 DEG. 55 SEC. WEST, 182.26 FEET TO AN IRON ROD FOUND; THENCE ALONG TRACES OF A FENCE LINE, NORTH 55 DEG. 00 MIN. 00 SEC. WEST, 132.00 FEET TO AN IRON ROD; THENCE FURTHER ALONG SAID TRACES OF FENCE, NORTH 57 DEG. 00 MIN. 00 SEC, WEST 305.58 FEET TO AN IRON ROD; THENCE FURTHER ALONG SAID TRACES OF FENCE, NORTH 59 DEG. 54 MIN. 28 SEC. WEST, 264.00 FEET TO AN IRON ROD; THENCE FURTHER ALONG SAID TRACES OF FENCE, NORTH 64 DEG. 01 MIN. 41 SEC. WEST, 65.87 FEET TO A FENCE CORNER POST; THENCE ALONG A FENCE LINE, SOUTH 42 DEG. 54 MIN. 58 SEC. WEST, 128.79 FEET TO AN IRON ROD; THENCE FURTHER ALONG SAID FENCE LINE, SOUTH 42 DEG. 35 MIN. 32 SEC. WEST, 450.32 FEET TO A FENCE POST; THENCE ALONG A FENCE LINE, SOUTH 80 DEG. 20 MIN. 23 SEC. WEST, 240.20 FEET TO A LIGHTARD KNOT FOUND AT THE SOUTHEAST CORNER OF THE NORTHWEST 1/4 OF THE SOUTHEAST 1/4 OF SECTION 1, TOWNSHIP 5 SOUTH, RANGE 13 WEST, HARRISON COUNTY, MISSISSIPPI; THENCE ALONG THE EAST LINE OF SAID NORTHWEST 1/4 OF THE SOUTHEAST 1/4 OF SECTION 1, TOWNSHIP 5 SOUTH, RANGE 13 WEST, HARRISON COUNTY, MISSISSIPPI; THENCE ALONG THE EAST LINE OF SAID NORTHWEST 1/4 OF THE SOUTHEAST 1/4 OF SECTION 1, NORTH 00 DEG. 08 MIN. 12 SEC, EAST, 1332.51 FEET TO AN IRON PIPE FOUND AT THE SOUTHEAST CORNER OF THE SOUTHEAST 1/4 OF THE NORTHEAST 1/4 OF SECTION 1, THENCE ALONG THE SOUTH LINE OF SAID SOUTHWEST 1/4 OF THE NORTHEAST 1/4 OF SECTION 1, NORTH 89 DEG. 45 MIN. 27 SEC. WEST, 2656.15 FEET TO AN IRON PIPE FOUND AT THE NORTHEAST CORNER OF THE NORTHWEST 1/4 OF THE SOUTHWEST 1/4 OF SECTION 1; THENCE ALONG THE EAST LINE OF THE SOUTHWEST 1/4 OF SECTION 1, SOUTH 00 DEG. 01 MIN. 23 SEC. WEST, 2674.07 FEET TO A CONCRETE MONUMENT FOUND AT THE SOUTHEAST CORNER OF THE SOUTHWEST 1/4 OF THE SOUTHWEST 1/4 OF SECTION 1; THENCE ALONG THE SOUTH LINE OF SAID SOUTHWEST 1/4 OF SECTION 1; SOUTH 89 DEG. 46 MIN, 58 SEC. WEST 1313.33 FEET TO THE POINT OF BEGINNING, CONTAINING 592.15 ACRES. SAID PROPERTY BEING SUBJECT A 125 FEET WIDE MISSISSIPPI POWER COMPANY RIGHTOF-WAY AT THE SOUTHWEST CORNER OF PROPERTY AS SHOWN ON SURVEY 592.15 ACS. THIRD, TOWNSHIP 5 SOUTH, RANGE 13 WEST SECTION 1: A PARCEL OF LAND SITUATED IN THE SOUTHWEST 1/4 OF SOUTHEAST 1/4 OF SECTION 1, TOWNSHIP 5 SOUTH, RANGE 13 WEST, HARRISON COUNTY, MISSISSIPPI, BEING MORE PARTICULARLY DESCRIBED AS FOLLOWS: SW 1/4 OF SE 1/4 LESS AND EXCEPT: 2.12 ACRES OF LAND, MORE OR LESS, LYING IN THE NORTHEAST 1/4 OF SOUTHWEST 1/4 OF SOUTHEAST 1/4, SAID 2.12 ACRES BEING MORE FULLY DESCRIBED AS FOLLOWS, TO-WIT: BEGIN AT THE NORTHEAST CORNER OF THE SOUTHWEST 1/4 OF SOUTHEAST 1/4 OF SECTION 1, TOWNSHIP 5 SOUTH, RANGE 13 WEST FOR THE POINT OF BEGINNING AND RUN SOUTH 00 DEG. 08 MIN. 00 SEC. WEST ALONG THE EAST LINE Of SAID SOUTHWEST 1/4 OF SOUTHEAST 1/4 363.70 FEET TO THE NORTH MARGIN OF A COUNTY ROAD; THENCE RUN NORTH 55 DEG. 46 MIN. 21 SEC. WEST ALONG SAID NORTH MARGIN OF COUNTY ROAD, 613.41 FEET TO THE NORTH LINE OF THE SOUTHWEST 1/4 OF SOUTHEAST 1/4 THENCE RUN NORTH 87 DEG. 53 MIN. 47 SEC. EAST ALONG SAID NORTH LINE OF THE SOUTHWEST OF SOUTHEAST 1/4, 508.37 FEET TO THE POINT OF BEGINNING 37.69 ACS. CONTAINING IN THE AGGREGATE 674.89 (629.84 ACRES IN HARRISON COUNTY AND 45.05 ACRES IN STONE COUNTY) ACRES OF LAND, MORE OR LESS. ALSO BEGIN AT THE SW CORNER OF THE SE 1/4 OF THE SW 1/4 OF SECTION 1 IN TOWNSHIP 5 SOUTH OF BASE LINE AND RANGE 13 WEST OF SAINT STEPHEN`S PRIME MERIDIAN AND THEN RUN EAST 118 FEET; THENCE RUN NORTH 361.5 FEET; THENCE RUN EAST 361.5 FEET; THENCE RUN SOUTH 361.5 FEET; THENCE RUN EAST 510.5 FEET; THENCE RUN NORTH 1320 FEET; THENCE RUN WEST 131 FEET; THENCE RUN NORTH 19 00` E 145 FEET; THENCE RUN N 58 00`W 340 FEET; THENCE RUN N 8 00` E 517.5 FEET; THENCE RUN N 68 30` W 10.5 FEET; THENCE RUN N 16 30E 520 FEET TO THE FORTY LINE; THENCE RUN WEST 825 FEET TO THE NW CORNER OF THE NE 1/4 OF SW 1/4 OF SAID SECTION; THENCE RUN SOUTH 2640 FEET TO THE POINT OF BEGINNING. THE PROPERTY CONTAINS 49 ACRES, MORE OR LESS. I will convey only such title as vested in me as Substituted Trustee. Jauregui & Lindsey Substituted Trustee Jauregui & Lindsey, LLC 244 Inverness Center Dr Ste 200 Birmingham, AL 35242 (205) 970-2233 Publication dates: September 14, 2016, September 21, 2016, September 28, 2016, October 5, 2016 1580693\n\t"},
{"page_url": "http://classifieds.sunherald.com/ms/biloxi-foreclosures/substituted-trustees-notice-o/C0A801551657c03C9FsQt240FBB5", "text": "\n\t\tSUBSTITUTED TRUSTEE'S NOTICE OF SALE STATE OF MISSISSIPPI COUNTY OF Harrison 1st WHEREAS, on the 28th day of July, 2014, Tanesha Tolbert and Malcom X Debose, wife and husband, executed and delivered a certain Deed of Trust unto First American Title Insurance Co., Trustee for Mortgage Electronic Registration Systems, Inc. as nominee for Mortgage Research Center, LLC dba Veterans United Home Loans, Beneficiary, to secure an indebtedness therein described, which Deed of Trust is recorded in the office of the Chancery Clerk of Harrison 1st County, Mississippi in Instrument# 2014 5943 T-J1; and WHEREAS, on the 28th day of March, 2016, Mortgage Electronic Registration Systems, Inc. as nominee for Mortgage Research Center, LLC dba Veterans United Home Loans, assigned said Deed of Trust unto PennyMac Loan Services, LLC, by instrument recorded in the office of the aforesaid Chancery Clerk in Instrument# 2 016-2585 -T-J1; and WHEREAS, on the 20th day of July, 2016 the Holder of said Deed of Trust substituted and appointed Michael Jedynak as Substitute Trustee by instrument recorded in the office of the aforesaid Chancery Clerk in Instrument# 2 016-7402 -T-J1; and WHEREAS, default having been made in the payments of the indebtedness secured by the said Deed of Trust, and the holder of said Deed of Trust, having requested the undersigned so to do, on the 6th day of October, 2016, I will during the lawful hours of between 11:00 a.m. and 4:00 p.m., at public outcry, offer for sale and will sell, at the East main door of the Harrison County Courthouse, 1st Judicial District, located on 23rd Avenue at Gulfport, Mississippi, for cash to the highest bidder, the following described land and property situated in Harrison 1st County, Mississippi, to-wit: Lot One Hundred Nine (109), Forest North Subdivision, Phase Four, a subdivision according to the official map or plat thereof on file and of the First Judicial District of Harrison County, Mississippi in Plat Book 42 at Page 39. I will only convey such title as is vested in me as Substitute Trustee. WITNESS MY SIGNATURE, this 9th day of September, 2016. Michael Jedynak Substitute Trustee 855 S Pear Orchard Rd., Ste. 404, Bldg. 400 Ridgeland, MS 39157 (318) 330-9020 /F16-0545 PUBLISH: 9-15-2016 / 9-22-2016 / 9-29-2016 1580756\n\t"},
{"page_url": "http://classifieds.sunherald.com/ms/biloxi-foreclosures/substituted-trustees-notice-o/C0A801551657c03C9Fmnp240FBB5", "text": "\n\t\tSUBSTITUTED TRUSTEE'S NOTICE OF SALE STATE OF MISSISSIPPI COUNTY OF Harrison 1st WHEREAS, on the 28th day of May, 2004, Chucky R. Beaver and Andrea L. Beaver, executed and delivered a certain Deed of Trust unto Stephen R. Colson, Trustee for Central Progressive Mortgage a division of Central Progressive Bank, Beneficiary, to secure an indebtedness therein described, which Deed of Trust is recorded in the office of the Chancery Clerk of Harrison 1st County, Mississippi in Instrument# 2 004-9982 -J1; and WHEREAS, on the 23rd day of July, 2015, the Holder of said Deed of Trust filed a Loan Modification Agreement of Deed of Trust by instrument recorded in the office of the aforesaid Chancery Clerk of Court in Instrument# 2015 6339T-J1; and WHEREAS, by various assignments on record said Deed of Trust was ultimately assigned to Wells Fargo Bank, NA by instrument recorded in the office of the aforesaid Chancery Clerk in Instrument# 2012 5870 T-J1; and WHEREAS, on the 7th day of January , 2014 the Holder of said Deed of Trust substituted and appointed Emily Kaye Courteau as Substitute Trustee by instrument recorded in the office of the aforesaid Chancery Clerk in Instrument# 2014 169 T-J1; and WHEREAS, default having been made in the payments of the indebtedness secured by the said Deed of Trust, and the holder of said Deed of Trust, having requested the undersigned so to do, on the 6th day of October, 2016, I will during the lawful hours of between 11:00 a.m. and 4:00 p.m., at public outcry, offer for sale and will sell, at the East main door of the Harrison County Courthouse, 1st Judicial District, located on 23rd Avenue at Gulfport, Mississippi, for cash to the highest bidder, the following described land and property situated in Harrison 1st County, Missis sippi, to-wit: A parcel of land being situated in and a part of Lot Sixty (60) of the Andrews Land Farm Tract No. 1, a subdivision according to the official map or plat thereof on file and of record in the Office of the Chancery Clerk of the First Judicial District of Harrison County, Mississippi, in Plat Book 9 at Page 12 (Copy Book 4 at Page 283) thereof, reference to which is hereby made in aid of and as a part of this description being a subdivision in Section 4, Township 8 South, Range 12 West, in said District, County and State, and being more particularly described as follows, to-wit: Commencing at the Northwest corner of said Lot 60 of said Andrews Land Farm Tract No. 1 in said Section 4, and thence from said point run South along the East margin of Espy Avenue and the Western boundary of said Lot 60 a distance of 115 feet to and for the Point of Beginning, thence continue South along the East margin of said Espy Avenue and the Western boundary of said Lot 60 a distance of 150 feet; thence run East along a fence line a distance of 160 feet; thence run North a distance of 150 feet, thence run West along a fence line a distance of 160.00 to the Point of Beginning. I will only convey such title as is vested in me as Substitute Trustee. WITNESS MY SIGNATURE, this 9th day of September, 2016. Emily Kaye Courteau Substitute Trustee 855 S Pear Orchard Rd., Ste. 404, Bldg. 400 Ridgeland, MS 39157 (318) 330-9020 /F13-1950 PUBLISH: 9-15-2016 / 9-22-2016 / 9-29-2016 1580757\n\t"},
{"page_url": "http://classifieds.sunherald.com/ms/biloxi-foreclosures/state-of-mississippi-county-of/C0A801551657c03C9FjsQ240FBB5", "text": "\n\t\tSTATE OF MISSISSIPPI COUNTY OF JACKSON SUBSTITUTE TRUSTEE'S NOTICE OF SALE WHEREAS, on the 7th day of March 2007, Ray E. Parsley and Leann P. Parsley executed and delivered a certain Deed of Trust unto R.E. Perkins, Jr., Trustee for First Federal Savings and Loan Association of PascagoulaMoss Point to secure an indebtedness therein described, which Deed of Trust is recorded in the office of the Chancery Clerk of Jackson County, Mississippi in Book 2553, Page 392, Records of Mortgages and Deeds of Trust on Land; and WHEREAS, on the 30th day of August 2016, the Holder of said Deed of Trust substituted and appointed Matthew E. Perkins as Trustee in said Deed of Trust, by instrument recorded in the office of the aforesaid Chancery Clerk in Book 3379, Pages 709-710; and WHEREAS, default having been made in the payments of the indebtedness secured by the said Deed of Trust, and the holder of said Deed of Trust having requested the undersigned so to do, on the 7th day of October 2016, I will during the lawful hours of between 11:00 a.m. and 4:00 p.m., at public outcry, offer for sale and will sell, at the west front door of the Jackson County Courthouse, 3104 Magnolia Street at Pascagoula, Mississippi, for cash to the highest bidder, the following described land and property situated in Jackson County, Mississippi, to-wit: That certain tract, piece or parcel of land located and situated in Section 22, Township 5 South, Range 6 West, Jackson County, Mississippi, and being more particularly described as: Commencing at a concrete monument marking the Southeast corner of the Northeast Quarter of the Southeast Quarter of said Section 22, and run thence West along the South line of said forty a distance of 225.5 feet to and for the point of beginning; thence continue West along the South line of said forty a distance of 250 feet; thence run North a distance of 140 feet to the Southwest corner of that certain tract of land conveyed to David Michael Porter and wife, on the 5th day of December, 1978, and recorded in Deed Book 635, Pages 159-160, Land Deed Records of Jackson County, Mississippi; thence run East along the South line of said Porter property a distance of 250 feet to the Southeast corner of said property; thence run South a distance of 140 feet to the point of beginning. AND ALSO: A right to ingress and egress along a road rightof-way, more particularly described as follows: Commencing at the Southeast corner of the Northeast Quarter of the Southeast Quarter of Section 22, Township 5 South, Range 6 West, Jackson County, Miss., and run thence West along the South line of said forty a distance of 145.5 feet to and for the point of beginning; thence continue West along the South line of said forty a distance of 80 feet; thence run North a distance of 20 feet; thence run East a distance of 80 feet; thence run South a distance of 20 feet to the point of beginning. I will only convey such title as is vested in me as Substitute Trustee. WITNESS MY SIGNATURE, this 9th day of September, 2016. /s/Matthew E. Perkins Substitute Trustee This instrument prepared by: Matthew E. Perkins 1103 Jackson Avenue Pascagoula, MS 39567 (228) 762-6631 MS Bar #PUBLISH: September 15, 2016; September 22, 2016; September 29, 2016; October 6, 2016 1580778\n\t"},
{"page_url": "http://classifieds.sunherald.com/ms/biloxi-foreclosures/trustees-notice-of-sale-where/C0A801551657c03C9FwGm2417DEA", "text": "\n\t\tTRUSTEE'S NOTICE OF SALE WHEREAS, on April 16, 2010, Beatrice S. Brown and Lucien J. Brown, a married couple executed a certain deed of trust for the benefit of Wells Fargo Bank, N.A. which deed of trust is of record in the office of the Chancery Clerk of Harrison County, State of Mississippi in Instrument No. 2010 1504T-J2; and WHEREAS, Wells Fargo Bank, N.A. has heretofore appointed Shapiro & Massey, LLC as Trustee by instrument dated August 26, 2016 and recorded in the aforesaid Chancery Clerk's Office in Instrument No. 2016 2645T-J2; and WHEREAS, default having been made in the terms and conditions of said deed of trust and the entire debt secured thereby having been declared to be due and payable in accordance with the terms of said deed of trust, Wells Fargo Bank, N.A., the legal holder of said indebtedness, having requested the undersigned Substituted Trustee to execute the trust and sell said land and property in accordance with the terms of said deed of trust and for the purpose of raising the sums due thereunder, together with attorney's fees, trustee's fees and expense of sale. NOW, THEREFORE, I, Shapiro & Massey, LLC, Trustee in said deed of trust, will on October 6, 2016 offer for sale at public outcry and sell within legal hours (being between the hours of 11:00 a.m. and 4:00 p.m.), at the South Front Door of the County Courthouse of Harrison County, located at Biloxi, Mississippi, to the highest and best bidder for cash the following described property situated in Harrison County, State of Mississippi, to-wit: Lot 148, Palm Ridge Estates, Phase II, according to the map or plat thereof on file and of record in the office of the Chancery Clerk of Harrison County, Mississippi, in Plat Book 26, at Page 20. I WILL CONVEY only such title as vested in me as Trustee. WITNESS MY SIGNATURE on this 10th day of September, 2016. Shapiro & Massey, LLC TRUSTEE Shapiro & Massey, LLC 1080 River Oaks Drive Suite B-202 Flowood, MS 39232 (601) 981-9299 17214 Palm Ridge Drive Diberville, MS 39540 16-017200AH Publication Dates: September 15, 22 and 29, 2016 1580805\n\t"},
{"page_url": "http://classifieds.sunherald.com/ms/biloxi-foreclosures/substituted-trustees-notice-o/C0A801541651803C9DsPi38896DD", "text": "\n\t\tSUBSTITUTED TRUSTEE'S NOTICE OF SALE WHEREAS, on March 26, 2010, Thomas E. Gara and Rene A. Gara, husband and Wife executed a certain deed of trust to Delta Title Corporation, Trustee for the benefit of Mortgage Electronic Registration Systems, Inc., as nominee for Envoy Mortgage, Ltd., its successors and assigns which deed of trust is of record in the office of the Chancery Clerk of Jackson County, State of Mississippi in Book 2895 at Page 844; and WHEREAS, said Deed of Trust was subsequently assigned to JPMorgan Chase Bank, National Association by instrument dated August 12, 2015 and recorded in Book 3302 at Page 110 of the aforesaid Chancery Clerk's office; and WHEREAS, JPMorgan Chase Bank, National Association has heretofore substituted Shapiro & Massey, LLC as Trustee by instrument dated January 25, 2016 and recorded in the aforesaid Chancery Clerk's Office in Book 3335 at Page 631; and WHEREAS, default having been made in the terms and conditions of said deed of trust and the entire debt secured thereby having been declared to be due and payable in accordance with the terms of said deed of trust, JPMorgan Chase Bank, National Association, the legal holder of said indebtedness, having requested the undersigned Substituted Trustee to ex ecute the trust and sell said land and property in accordance with the terms of said deed of trust and for the purpose of raising the sums due thereunder, together with attorney's fees, trustee's fees and expense of sale. NOW, THEREFORE, I, Shapiro & Massey, LLC, Substituted Trustee in said deed of trust, will on October 5, 2016 offer for sale at public outcry and sell within legal hours (being between the hours of 11:00 a.m. and 4:00 p.m.), at the Main West Front Door of the County Courthouse of Jackson County, located at Pascagoula, Mississippi, to the highest and best bidder for cash the following described property situated in Jackson County, State of Mississippi, to-wit: A certain lot of ground, together with all the buildings and improvements thereon, and all the rights, ways, privileges, servitudes, appurtenances and advantages thereunto belonging or in anywise appertaining, situated in the County of Jackson, State of Mississippi more fully described as follows, to-wit: Lot 2, Trentwood Subdivision, Phase 4 a subdivision according to the official map or plat thereof on file and of record in the office of the Chancery Clerk of Jackson County, Mississippi in Plat Book 21 at Page 25. Municipal Address: 3116 Shadow Wood Drive Ocean Springs, MS 39564 I WILL CONVEY only such title as vested in me as Substituted Trustee. WITNESS MY SIGNATURE on this 6th day of September, 2016. Shapiro & Massey, LLC SUBSTITUTED TRUSTEE Shapiro & Massey, LLC 1080 River Oaks Drive Suite B-202 Flowood, MS 39232 (601) 981-9299 3116 Shadow Wood Drive Ocean Springs, MS 39564 15-015087AH Publication Dates: September 14, 21 and 28, 2016 1580667\n\t"},
{"page_url": "http://classifieds.sunherald.com/ms/biloxi-foreclosures/substituted-trustees-notice-o/C0A801541651803C9Dnvo38896DD", "text": "\n\t\tSUBSTITUTED TRUSTEE'S NOTICE OF SALE WHEREAS, on March 23, 1995, Michael W. Hutchins, executed a certain deed of trust to Charles A. Pitcher, Trustee for the benefit of Citizens National Bank which deed of trust is of record in the office of the Chancery Clerk of Jackson County, State of Mississippi in Book 1289 at Page 881; and WHEREAS, said Deed of Trust was subsequently assigned to JPMorgan Chase Bank, National Association by instrument dated July 25, 2016 and recorded in Book 3374 at Page 809 of the aforesaid Chancery Clerk's office; and WHEREAS, JPMorgan Chase Bank, National Associ ation has heretofore substituted Shapiro & Massey, LLC as Trustee by instrument dated August 5, 2016 and recorded in the aforesaid Chancery Clerk's Office in Book 3377 at Page 871; and WHEREAS, default having been made in the terms and conditions of said deed of trust and the entire debt secured thereby having been declared to be due and payable in accordance with the terms of said deed of trust, JPMorgan Chase Bank, National Association, the legal holder of said indebtedness, having requested the undersigned Substituted Trustee to execute the trust and sell said land and property in accordance with the terms of said deed of trust and for the purpose of raising the sums due thereunder, together with attorney's fees, trustee's fees and expense of sale. NOW, THEREFORE, I, Shapiro & Massey, LLC, Substituted Trustee in said deed of trust, will on October 5, 2016 offer for sale at public outcry and sell within legal hours (being between the hours of 11:00 a.m. and 4:00 p.m.), at the Main West Front Door of the County Courthouse of Jackson County, located at Pascagoula, Mississippi, to the highest and best bidder for cash the following described property situated in Jackson County, State of Mississippi, to-wit: Lot 28, Lincoln Heights Subdivision, Fourth Addition, as per plat thereof recorded in Plat Book 6, Page 36, Record of Official Plats on file in the Office of the Chancery Clerk of Jackson County, Mississippi. I WILL CONVEY only such title as vested in me as Substituted Trustee. WITNESS MY SIGNATURE on this 6th day of September, 2016. Shapiro & Massey, LLC SUBSTITUTED TRUSTEE Shapiro & Massey, LLC 1080 River Oaks Drive Suite B-202 Flowood, MS 39232 (601) 981-9299 2612 Pleasant Drive Pascagoula, MS 39581 10-001782GW Publication Dates: September 14, 21, 28, 2016 1580616\n\t"},
{"page_url": "http://classifieds.sunherald.com/ms/biloxi-foreclosures/notice-of-substituted-trustee/C0A801541651803C9DjJL38896DD", "text": "\n\t\tNOTICE OF SUBSTITUTED TRUSTEE'S SALE OF LAND WHEREAS, Richard A. Grimstead and Bonnie Grimstead executed that certain Deed of Trust to Joy Lambert Phillips, Trustee, for the use and benefit of Hancock Bank, a Mississippi state chartered Bank, now known as Whitney Bank, a Mississippi state chartered Bank, dated June 26, 2008 and filed for record in the office of the Chancery Clerk of the First Judicial District of Harrison County, Mississippi and recorded as Instrument No. 2 008-8821 -T-J1; and,  WHEREAS, Whitney Bank, a Mississippi state chartered Bank, formerly known as Hancock Bank, a Mississippi state chartered Bank, appointed and substituted Jerry D. Riley as Substituted Trustee in place and instead of Joy Lambert Phillips as was their right to do under the terms of said Deed of Trust. Said Substitution of Trustee being dated August 29, 2016 and filed for record in the office of the Chancery Clerk of the First Judicial District of Harrison County, Mississippi and recorded as Instrument No. 2 016-7404 -T-J1; and, WHEREAS, default having been made in the terms and conditions of said Deed of Trust and the entire debt secured having been declared due and payable in accordance with the terms of said Deed of Trust, and the legal holder of said indebtedness, having requested the undersigned Substituted Trustee to execute the trust and sell said land and property in accordance with the terms of said Deed of Trust for the purpose of raising sums due thereunder together with attorney's fees and expenses of sale;  NOW, THEREFORE, the undersigned Substituted Trustee, pursuant to the authority and the request so made, does hereby give notice that he will sell during the legal hours, (between the hours of 11:00 a.m. and 4:00 p.m.) on the 6th day of October, 2016, at the east front door of the Harrison County Courthouse, Gulfport, Mississippi, for cash to the highest and best bidder, the following described land and property located and being situated in the County of Harrison, First Judicial District, State of Mississippi and being more particularly described as follows, to-wit: Commence at the NW corner of the SW 1/4 of the NW 1/4 of Section 6, Township 7 South, Range 12 West, Harrison County, Mississippi and run thence South a distance of 409 feet to a stake set on the northerly margin of a roadway known as Red Creek Road; thence run South 42 degrees 19 minutes 36 seconds East along the northerly margin of said roadway a distance of 191.21 feet to an iron pipe which is the Point of Beginning of the tract herein described; thence from said point of beginning continue South 42 degrees 19 minutes 36 seconds East along the northerly margin of said roadway a distance of 144.39 feet to a point marked with an iron pipe; thence run Easterly a distance of 476 feet to a point on the north margin of a county roadway marked by an iron pipe; thence run North 25 degrees 28 minutes 47 seconds West a distance of 510.08 feet to an iron pipe; thence run South 42 degrees 37 minutes 16 seconds West a distance of 488.28 feet to the Point of Beginning; being situated in and a part of the Southwest 1/4 of the Northwest 1/4, less the Southwest 1/4 thereof, Section 6, Township 7 South, Range 12 West, and containing 3.45 acres, more or less. The above described property being identified as Parcel 2 on plat or survey by Edward Jermyn, RLS, Fairley Engineering, Inc., a copy of which is recorded in Book 812 at Page 248 in the Office of the Chancery Clerk of the First Judicial District of Harrison County, Mississippi.  LESS AND EXCEPT THE FOLLOWING DESCRIBED PARCEL: Commence at the Northwest corner of the Southwest 1/4 of the Northwest 1/4 of Section 6, Township 7 South, Range 12 West, Harrison County, Mississippi and thence run South 313.92 feet to a point situated on the east margin of Wolf River Road; thence run South 34 degrees 56 minutes 10 seconds East along the east margin of said road a distance of 418.05 feet to the Point of Beginning of that property herein described. From said point of beginning, thence continue South 34 degrees 56 minutes 10 seconds East along the east margin of said road 33.79 feet to a point; thence run South 85 degrees 23 minutes 15 seconds East 389.92 feet to a point on the north margin of Shortcut Road; thence run North 75 degrees 47 minutes East 33.79 feet to a point; thence run North 18 degrees 46 minutes 45 seconds West 325.16 feet to a point; thence run South 57 degrees 20 minutes 30 seconds West 148.33 feet to a point; thence run South 25 degrees 51 minutes West 104.21 feet to a point; thence run South 55 degrees 30 minutes 25 seconds West 152.85 feet to a point; thence run South 85 degrees 23 minutes 15 seconds West 39.97 feet to the Point of Beginning.  SUCH SALE will be held without covenant or warranty regarding title, possession, encumbrances or otherwise, and I, the undersigned Substituted Trustee, will convey only such title as is vested in me as Substituted Trustee. WITNESS MY SIGNATURE, this the 1st day of September, 2016. Jerry D. Riley, Substituted Trustee P O Box 550, Gulfport, MS 39502 228-864-4511 Publication Date September 14, 21, 28, October 5, 2016 1580533\n\t"},
{"page_url": "http://classifieds.sunherald.com/ms/biloxi-foreclosures/substitute-trustees-notice-of/C0A80154162c003CA8KxHmA5A164", "text": "\n\t\tSUBSTITUTE TRUSTEE'S NOTICE OF SALE WHEREAS, on May 8, 2007, Jimmy V. Dennison and Charles Alcus Dennison, Sr. executed a deed of trust to Andrew Remson, Trustee for the benefit of America's Mortgage Resource, Inc., which deed of trust is recorded as Instrument No. 2 007-9889 T-J1 in the office of the Chancery Clerk of the First Judicial District of Harrison County, Mississippi; and WHEREAS, said Deed of Trust was assigned by America's Mortgage Resource, Inc. to U.S. Bank, N.A., by instrument dated May 8, 2007, and recorded in Instrument No. 2 007-1266 6T-J1 of the records of the aforesaid Chancery Clerk; and WHEREAS, U.S. BANK NATIONAL ASSOCIATION, the holder of the deed of trust, substituted either James L. DeLoach or David E. Flautt as Trustee, as authorized by the terms thereof, by instrument dated August 9, 2016, recorded and spread at large upon the records in the office of the aforesaid Chancery Clerk on August 19, 2016, as Instrument No. 2 016-7026 T-J1, prior to the posting and publication of this notice; and WHEREAS, default having been made in the terms and conditions of the deed of trust, and the entire debt secured thereby having been declared to be due and payable in accordance with the terms of the deed of trust, and the legal holder of said indebtedness, U.S. BANK NATIONAL ASSOCIATION, has requested the undersigned Substitute Trustee to execute the trust and sell said land, property and improvements in accordance with the terms of the deed of trust for the purpose of raising the sums due thereunder, together with attorney's fees, Substitute Trustee's fees and expenses of sale; THEREFORE, on September 29, 2016, the undersigned, as Substitute Trustee in the deed of trust, will offer for sale at public outcry and sell to the highest bidder for cash, within legal hours (being between the hours of 11:00 a.m. and 4:00 p.m.) East front door of the Harrison County Courthouse in Gulfport, Mississippi, the following described land, property and improvements lying and being situate in the First Judicial District of Harrison County, Mississippi, towit: Lot 35, EDGEWOOD SUBDIVISION, PHASE 1, as per map or plat on file and of record in the Harrison County, Chancery Clerks Office, First Judicial District, State of Mississippi, in Plat Book 46 at Page 3. The property is subject to a 15 foot utility easement along the Northwestern margin and a 10 foot utility easement along the Southeastern margin of the property as shown on the plat. I WILL CONVEY only such title as is vested in me as Substitute Trustee. WITNESS MY SIGNATURE, this the 31st day of August, 2016 /s/ David E. Flautt  David E. Flautt Substitute Trustee 299 South 9th Street, Suite 205 Oxford, MS 38655 (662) 279-8370 Foreclosurehotline.net       File No.: 5295316 PUBLISH: September 8, 2016; September 15, 2016; September 22, 2016 1580448\n\t"},
{"page_url": "http://classifieds.sunherald.com/ms/biloxi-foreclosures/substitute-trustees-notice-of/C0A80154162c003CA8PMTkA5A164", "text": "\n\t\tSUBSTITUTE TRUSTEE'S NOTICE OF SALE STATE OF MS COUNTY OF HARRISON WHEREAS, on 05/23/14, David M. Morris and Susan Morris executed and delivered a certain Deed of Trust unto Scott Everett, Trustee for the benefit of Mortgage Electronic Registration Systems, Inc., as nominee for Everett Financial, Inc. DBA Supreme Lending, Its successors and assigns, to secure an indebtedness therein described, which Deed of Trust is recorded in the office of the Chancery Clerk of HARRISON County, Mississippi in Instrument Number 2 014-4141 T-J1 . WHEREAS, said Deed of Trust was subsequently assigned unto Pacific Union Financial, LLC, by instrument recorded in the Office of the aforesaid Chancery Clerk in Instrument Number 2 016-5551 T-J1. WHEREAS, the holder of said Deed of Trust substituted and/or appointed Priority Trustee Services of Mississippi, LLC., as Trustee in said Deed of Trust by instrument recorded in the Office of the aforesaid Chancery Clerk in Instrument Number 2 016-6663 -T-J1. WHEREAS, default having been made in the payments of indebtedness secured by said Deed of Trust, and the holder of said Deed of Trust, having requested the undersigned so to do, on September 29, 2016 the Substitute or Appointed Trustee shall, during legal hours (between the hours of 11 o' clock a.m. and 4 o' clock p.m.), at public outcry, offer for sale and will sell, at the front door on the East Side of the Harrison County 1st JDC Courthouse, for cash or certified check only (the wiring of funds will not be accepted) to the highest bidder, the following described land and property situated in HARRISON County, Mississippi, to-wit: Lot 5, Cardinal Pointe Subdivision, Phase Two, a subdivision according to the official map or plat thereof on file and of record in the office of the Chancery Clerk of the First Judicial District of Harrison County, Mississippi in Plat Book 55 at Page 37. Property is being sold \"as-is where-is\". WITNESS MY SIGNATURE, this the September 1, 2016 Charity Bridgewater, Assistant Vice President Priority Trustee Services of Mississippi, LLC. 2970 Clairmont Road NE, Suite 780 Atlanta, Georgia 30329 770-234-9181 File No.: 8734.20129 PUBLISH: 09/08/16 09/15/16, 09/22/16 TS#: 8734.20129 FEI # 2013.04583 09/08/2016, 09/15/2016, 09/22/2016, 1580535\n\t"},
{"page_url": "http://classifieds.sunherald.com/ms/biloxi-foreclosures/substituted-trustees-notice-o/C0A801541632403CB1YNrV129631", "text": "\n\t\tSUBSTITUTED TRUSTEE'S NOTICE OF SALE WHEREAS, on December 8, 2009, Zodeen Jane Fry Surviving Joint Tenant, executed a certain deed of trust to First Attorney Title, Trustee for the benefit of Mortgage Electronic Registration Systems, Inc., as nominee for Financial Freedom Acquisition LLC, its successors and assigns which deed of trust is of record in the office of the Chancery Clerk of Jackson County, State of Mississippi in Book 2886 at Page 164; and WHEREAS, said Deed of Trust was subsequently assigned to CIT Bank, N.A., its successors and assigns by instrument dated August 12, 2015 and recorded in Book 3306 at Page 179 of the aforesaid Chancery Clerk's office; and WHEREAS, CIT Bank, N.A. has heretofore substituted Shapiro & Massey, LLC as Trustee by instrument dated August 1, 2016 and recorded in the aforesaid Chancery Clerk's Office in Book 3376 at Page 292; and WHEREAS, default having been made in the terms and conditions of said deed of trust and the entire debt secured thereby having been declared to be due and payable in accordance with the terms of said deed of trust, CIT Bank, N.A., the legal holder of said indebtedness, having requested the undersigned Substituted Trustee to execute the trust and sell said land and property in accordance with the terms of said deed of trust and for the purpose of raising the sums due thereunder, together with attorney's fees, trustee's fees and expense of sale. NOW, THEREFORE, I, Shapiro & Massey, LLC, Substituted Trustee in said deed of trust, will on October 7, 2016 offer for sale at public outcry and sell within legal hours (being between the hours of 11:00 a.m. and 4:00 p.m.), at the Main West Front Door of the County Courthouse of Jackson County, located at Pascagoula, Mississippi, to the highest and best bidder for cash the following described property situated in Jackson County, State of Mississippi, to-wit: Situated in the County of Jackson, State of Mississippi Lot 9 of Lincoln Heights Subdivision, Fourth Addition, as per plat recorded in Plat Book 6, Page 36, in the Office of the Chancery Clerk, Jackson County, Mississippi said lot located in Pascagoula, Mississippi. Tax ID No. 41785179.000 Being the same property conveyed by Warranty Deed Grantor Howard Houston Bouler and wife, Nina Mae Bouler Grantee Jacob B. Fry and wife, Zodeen Jane Fry, as joint tenants with the full right of survivorship Dated 3/25/1974 Recorded 3/27/1974 DOC#/Book-Page 493-567 Note For Street numbering purposes known as 4610 Legare Ave, Pascagoula, Mississippi 39581 I WILL CONVEY only such title as vested in me as Substituted Trustee. WITNESS MY SIGNATURE on this 23rd day of August, 2016. Shapiro & Massey, LLC SUBSTITUTED TRUSTEE Shapiro & Massey, LLC 1080 River Oaks Drive, Suite B-202 Flowood, MS 39232 (601) 981-9299 4610 Legare Avenue Pascagoula, MS 39581 16-016790BE Publication Dates: September 9, 16, 23 and 30, 2016 1580486\n\t"},
{"page_url": "http://classifieds.sunherald.com/ms/biloxi-foreclosures/substituted-trustees-notice-o/C0A801541632403CB1njLq129631", "text": "\n\t\tSUBSTITUTED TRUSTEE'S NOTICE OF SALE WHEREAS, on February 9, 2009, Erica J. Trahan, a single woman as her sole and separate property executed a certain deed of trust to Dukes, Dukes Keating & Faneca, Trustee for the benefit of Mortgage Electronic Registration Systems, Inc. as nominee for America's Mortgage Resource, Inc. a Corporation, its successors and assigns which deed of trust is of record in the office of the Chancery Clerk of Harrison County, State of Mississippi in Instrument No. 2009 1652T-J1; and WHEREAS, said Deed of Trust was subsequently assigned to JPMorgan Chase Bank, National Association by instrument dated October 17, 2013 and recorded in Instrument No. 2013 11570T-J1 of the aforesaid Chancery Clerk's office; and WHEREAS, JPMorgan Chase Bank, National Association has heretofore substituted Shapiro & Massey, LLC as Trustee by instrument dated August 11, 2016 and recorded in the aforesaid Chancery Clerk's Office in Instrument No. 2016 7012 T-J1; and WHEREAS, default having been made in the terms and conditions of said deed of trust and the entire debt secured thereby having been declared to be due and payable in accordance with the terms of said deed of trust, JPMorgan Chase Bank, National Association, the legal holder of said indebtedness, having requested the undersigned Substituted Trustee to execute the trust and sell said land and property in accordance with the terms of said deed of trust and for the purpose of raising the sums due thereunder, together with attorney's fees, trustee's fees and expense of sale. NOW, THEREFORE, I, Shapiro & Massey, LLC, Substituted Trustee in said deed of trust, will on September 30, 2016 offer for sale at public outcry and sell within legal hours (being between the hours of 11:00 a.m. and 4:00 p.m.), at the East Main Door of the County Courthouse of Harrison County, located at Gulfport, Mississippi, to the highest and best bidder for cash the following described property situated in Harrison County, State of Mississippi, to-wit: Lot 208, Replat of Lots 206-210, Windsong Subdivision, Phase, Five, a subdivision according to the official map or plat thereof on file and of record in the office of the Chancery Clerk of the First Judicial District of Harrison County, Mississippi. I WILL CONVEY only such title as vested in me as Substituted Trustee. WITNESS MY SIGNATURE on this 30th day of August, 2016. Shapiro & Massey, LLC SUBSTITUTED TRUSTEE Shapiro & Massey, LLC 1080 River Oaks Drive Suite B-202 Flowood, MS 39232 (601) 981-9299 13409 Locust Hill Drive Gulfport, MS 39503 16-017121AH Publication Dates: September 9, 16 and 23, 2016 1580491\n\t"},
{"page_url": "http://classifieds.sunherald.com/ms/biloxi-foreclosures/substituted-trustees-notice-o/C0A801541632403CB1MjwM129631", "text": "\n\t\tSUBSTITUTED TRUSTEE'S NOTICE OF SALE STATE OF MISSISSIPPI COUNTY OF Harrison 1st WHEREAS, on the 1st day of August, 2005, Janette D Howard and James J Howard, executed and delivered a certain Deed of Trust unto Jerry Halbrook, Trustee for Mortgage Electronic Registration Systems, Inc as nominee for USAA Federal Savings Bank, Beneficiary, to secure an indebtedness therein described, which Deed of Trust is recorded in the office of the Chancery Clerk of Harrison 1st County, Mississippi in Instrument# 2005 34592T-J1; and WHEREAS, on the 10th day of June, 2015, Mortgage Electronic Registration Systems, Inc as nominee for USAA Federal Savings Bank, assigned said Deed of Trust unto Green Tree Servicing, LLC, by instrument recorded in the office of the aforesaid Chancery Clerk in Instrument# 2 015-4919 -T-J1; and WHEREAS, on the 30th day of August, 2016, the Holder of said Deed of Trust substituted and appointed Emily Kaye Courteau as Substitute Trustee by instrument recorded in the office of the aforesaid Chancery Clerk in Instrument# 20167-372-T-J1; and WHEREAS, default having been made in the payments of the indebtedness secured by the said Deed of Trust, and the holder of said Deed of Trust, having requested the undersigned so to do, on the 30th day of September, 2016, I will during the lawful hours of between 11:00 a.m. and 4:00 p.m., at public outcry, offer for sale and will sell, at the East main door of the Harrison County Courthouse, 1st Judicial District, located on 23rd Avenue at Gulfport, Mississippi, for cash to the highest bidder, the following described land and property situated in Harrison 1st County, Mississippi, to-wit: A parcel of land being a part of the Leighton parcel of the subdivision of the South of the Northwest of Section 29, Township 6 South, Range 10 West, Harrison County, Mississippi, as recorded in Deed Book 520 on Page 303, and being more particularly described as follows: Commencing at an iron pipe at the Northeast corner of the Southwest 1/4 of the Northwest 1/4 of said Section 29; thence South 89 degrees, 49 minutes, 20 seconds West 151.07 feet; thence South 00 degrees, 01 minute, 50 seconds West 958.57 feet, thence South 89 degrees, 30 minutes, 12 seconds West 1,158.12 feet to an iron rod lying on the North line of aforesaid Leighton parcel, and also lying on the East margin of John Lee Road; thence also said margin, South 00 degrees, 04 minutes, 19 seconds West 30.00 feet to an iron rod at the Point of beginning, said point lying on the South margin of a 30 foot road right-of-way; thence along said South margin, North 89 degrees, 50 minutes, 12 seconds East 317.90 feet to an iron rod; thence South 01 degree 40 minutes, 00 seconds East 300.037 feet to an iron rod; thence South 89 degrees, 27 minutes, 54 seconds West 327.02 feet to an iron rod lying on said East margin of John Lee Road; thence along said East margin North 00 degrees, 04 minutes, 19 seconds East 300.54 feet to the Point of Beginning. Containing 2.224 acres I will only convey such title as is vested in me as Substitute Trustee. WITNESS MY SIGNATURE, this 6th day of September, 2016. Emily Kaye Courteau Substitute Trustee 855 S Pear Orchard Rd., Ste. 404, Bldg. 400 Ridgeland, MS 39157 (318) 330-9020 rcs/F16-0719 PUBLISH: 9-9-2016 / 9-16-2016 / 9-23-2016 1580545\n\t"},
{"page_url": "http://classifieds.sunherald.com/ms/biloxi-foreclosures/substituted-trustees-notice-o/C0A801541632403CB1JjXV129631", "text": "\n\t\tSUBSTITUTED TRUSTEE'S NOTICE OF SALE STATE OF MISSISSIPPI COUNTY OF Harrison 1st WHEREAS, on the 29th day of October, 2010, Richard James Krymski and wife, Natalie Faye Krymski, as joint tenants with full rights of survivorship and not as tenants in common, executed and delivered a certain Deed of Trust unto Jeffrey Wagner, Trustee for Wells Fargo Bank, N.A., Beneficiary, to secure an indebtedness therein described, which Deed of Trust is recorded in the office of the Chancery Clerk of Harrison 1st County, Mississippi in Instrument# 2 010-1124 4T-J1; and WHEREAS, on the 29th day of August, 2016, the Holder of said Deed of Trust substituted and appointed Emily Kaye Courteau as Substitute Trustee by instrument recorded in the office of the aforesaid Chancery Clerk in Instrument# 2 016-7420 -T-J1; and WHEREAS, default having been made in the payments of the indebtedness secured by the said Deed of Trust, and the holder of said Deed of Trust, having requested the undersigned so to do, on the 30th day of September, 2016, I will during the lawful hours of between 11:00 a.m. and 4:00 p.m., at public outcry, offer for sale and will sell, at the East main door of the Harrison County Courthouse, 1st Judicial District, located on 23rd Avenue at Gulfport, Mississippi, for cash to the highest bidder, the following described land and property situated in Harrison 1st County, Mississippi, to-wit: The following described property: Lot One (1), Reservation Estates Subdivision, Section One (1), a subdivision according to the official map or plat thereof on file and of record in the office of the Chancery Clerk, of the First Judicial District of Harrison County, Mississippi, in Plat Book 30 at Page 17 thereof, reference to which is hereby made in aid of and as a part of this description. I will only convey such title as is vested in me as Substitute Trustee. WITNESS MY SIGNATURE, this 6th day of September, 2016. Emily Kaye Courteau Substitute Trustee 855 S Pear Orchard Rd., Ste. 404, Bldg. 400 Ridgeland, MS 39157 (318) 330-9020 rcs/F16-0744 PUBLISH: 9-9-2016 / 9-16-2016 / 9-23-2016 1580546\n\t"},
{"page_url": "http://classifieds.sunherald.com/ms/biloxi-foreclosures/substituted-trustees-notice-o/C0A801541632403CB1orNG129631", "text": "\n\t\tSUBSTITUTED TRUSTEE'S NOTICE OF SALE STATE OF MISSISSIPPI COUNTY OF Harrison 1st WHEREAS, on the 17th day of July, 2008, Margaret Elliott Baine, executed and delivered a certain Deed of Trust unto Harry R Allen, Trustee for Hancock Bank, Beneficiary, to secure an indebtedness therein described, which Deed of Trust is recorded in the office of the Chancery Clerk of Harrison 1st County, Mississippi in Instrument# 2008 11938 T-J1; and WHEREAS, on the 28th day of July, 2016, Hancock Bank, assigned said Deed of Trust unto Federal National Mortgage Association , by instrument recorded in the office of the aforesaid Chancery Clerk in Instrument# 2016 6475 T-J1; and WHEREAS, on the 25th day of August, 2016 the Holder of said Deed of Trust substituted and appointed Michael Jedynak as Substitute Trustee by instrument recorded in the office of the aforesaid Chancery Clerk in Instrument# 2 016-7352 -T-J1; and WHEREAS, default having been made in the payments of the indebtedness secured by the said Deed of Trust, and the holder of said Deed of Trust, having requested the undersigned so to do, on the 30th day of September, 2016, I will during the lawful hours of between 11:00 a.m. and 4:00 p.m., at public outcry, offer for sale and will sell, at the East main door of the Harrison County Courthouse, 1st Judicial District, located on 23rd Avenue at Gulfport, Mississippi, for cash to the highest bidder, the following described land and property situated in Harrison 1st County, Mississippi, to-wit: The West 5.8' feet of Lot 10 and all of Lots 11, 12, and 13, inclusive, Block 7, Grasslawn Addition to the City of Gulfport, Mississippi, as per the map or plat thereof on file and of record in the office of the Chancery Clerk for the First Judicial District of Harrison County, Mississippi. I will only convey such title as is vested in me as Substitute Trustee. WITNESS MY SIGNATURE, this 6th day of September, 2016. Michael Jedynak Substitute Trustee 855 S Pear Orchard Rd., Ste. 404, Bldg. 400 Ridgeland, MS 39157 (318) 330-9020 rcs/F16-0382 PUBLISH: 9-9-2016 / 9-16-2016 / 9-23-2016 1580544\n\t"},
{"page_url": "http://classifieds.sunherald.com/ms/biloxi-foreclosures/substitute-trustees-notice-of/C0A801571645003D08Ssuq47D717", "text": "\n\t\tSUBSTITUTE TRUSTEE'S NOTICE OF FORECLOSURE SALE WHEREAS, on March 20, 1998, Darlene K. Blaker and Gerry M. Blaker executed a certain deed of trust to H.E. Ellis, Sr., Trustee for the use and benefit of Nations Funding of MS, Inc., which deed of trust is of record in the office of the Chancery Clerk of Harrison, County, state of Mississippi, in Book 1855, Page 412; and WHEREAS, The Bank of New York Mellon f/k/a The Bank of New York as successor in interest to JPMorgan Chase Bank, National Association, as Trustee for C-BASS Mortgage Loan Asset-Backed Certificates, Series 2006-RP1, the current holder and/or assignee, substituted Jauregui & Lindsey, LLC as Trustee by instrument recorded in the Chancery Clerk's Office on August 29, 2016 in Instrument Number, 2016 7235 T -J1; and WHEREAS, Default having been made in the terms and conditions of said deed of trust and the entire debt secured thereby having been declared to be due and payable in accordance with the terms of said deed of trust, The Bank of New York Mellon f/k/a The Bank of New York as successor in interest to JPMorgan Chase Bank, National Association, as Trustee for C-BASS Mortgage Loan Asset-Backed Certificates, Series 2006-RP1, the legal holder of said indebtedness, having requested the undersigned Substitute Trustee in said deed of trust, will on October 6, 2016 offer for sale at public outcry and sell within legal hours (being between the hours of 11:00 a.m. and 4:00 p.m.), at the main front door of the County Courthouse of Harrison County in Gulfport, Mississippi, to the highest and best bidder for cash the following described property situated in Harrison County, Mississippi, to wit: LOT 43, PECAN PARK SUBDIVISION, PART VIII, First Judicial District of Harrison County, Mississippi, as per the official plat of said subdivision filed in the office of the Chancery Clerk of the first Judicial District of Harrison County, Mississippi, and recorded in Plat Book 31, page 37.  I will convey only such title as vested in me as Substituted Trustee. Jauregui & Lindsey, LLC Substituted Trustee Jauregui & Lindsey, LLC 244 Inverness Center Dr Ste 200 Birmingham, AL 35242 (205) 970-2233 Publication dates: September 12, 2016, September 19, 2016, September 26, 2016, October 3, 2016 1580625\n\t"},
{"page_url": "http://classifieds.sunherald.com/ms/biloxi-foreclosures/substitute-trustees-notice-of/C0A80180164b403C9ERMXkD11A17", "text": "\n\t\tSUBSTITUTE TRUSTEE'S NOTICE OF SALE WHEREAS, on the October 20, 2008, Eldridge Levy and Leola F Levy, executed a Deed of Trust to James B. Wright, PA, Trustee for the use and benefit of Equipoint Financial Network, Inc., which Deed of Trust is on file and of record in the office of the Chancery Clerk of Harrison (1st District Gulfport) County, Mississippi, in Deed of Trust Document No. 2 008-1560 4T-J1 thereof;  WHEREAS, said Deed of Trust was ultimately assigned to James B. Nutter & Company by assignment on file and of record in the office of the Chancery Clerk of Harrison (1st District Gulfport) County, Mississippi, as Instrument No. 2 008-1709 9T-J1 thereof; and WHEREAS, the legal holder of the said Deed of Trust and the note secured thereby, substituted Wilson & Associates, P.A., as Trustee therein, as authorized by the terms thereof, by instrument recorded in the office of the aforesaid Chancery Clerk as Instrument No. 2 016-6617 T-J1 thereof; and WHEREAS, default having been made in the performance of the conditions and stipulations as set forth by said Deed of Trust, and having been requested by the legal holder of the indebtedness secured and described by said Deed of Trust so to do, notice is hereby given that Wilson & Associates, P.A. f/k/ a Adams & Edens, P.A., Substitute Trustee, by virtue of the authority conferred upon me in said Deed of Trust, will offer for sale and will sell at public sale and outcry to the highest and best bidder for certified funds paid at the conclusion of the sale, or credit bid from a bank or other lending entity pre-approved by the successor trustee, during the legal hours (between the hours of 11 o'clock a.m. and 4 o'clock p.m.) at the front door on the east side of the Courthouse, on October 4, 2016, the following described land and property being the same land and property described in said Deed of Trust, situated in Harrison (1st District Gulfport) County, State of Mississippi, to-wit: A parcel of land situated and being located in the Southwest 1/4 of the Southeast 1/4 of Section 31, Township 4 South, Range 11 West, First Judicial District of Harrison County, Mississippi and being more particularly described as follows, to-wit: Beginning at a point on the southerly right-ofway of State Route Highway 67 being 30 feet east of the west line of the said Southwest 1/4 of the Southeast 1/4; thence run the following courses and distances along the southerly right-of-way of State Route Highway 67: South 46 degrees 41 minutes 38 seconds East 93.12 feet; South 12 degrees 40 minutes 56 seconds West 118.29 feet; South 46 degrees 17 minutes 00 seconds East 229.71 feet; South 74 degrees 47 minutes 57 seconds East 153.86 feet; South 42 degrees 11 minutes 47 seconds East 80.00 feet; thence run South 00 degrees 20 minutes 02 seconds West 181.79 feet to the north margin of Old Cunningham Road; thence run South 89 degrees 08 minutes 30 seconds West 353.97 feet along the north margin of Cunningham Road to a point on a curve concave to the southeast having a radius of 66.48 feet; thence run Southwesterly 66.76 feet along said curve and the north margin of Cunningham Road through an angle of 57 degrees 32 minutes 13 seconds to a point being South 60 degrees 22 minutes 23 seconds West 63.99 feet from the aforementioned point; thence run North 00 degrees 03 minutes 01 seconds East 656.36 feet to the Point of Beginning. Legal description revised pursuant to a Final Judgment recorded in the property records of the First Judicial District of Harrison County at Instrument No. 2 016-8360 D-J1 and Instrument No. 2 016-3952 T-J1.  Title to the above described property is believed to be good, but I will convey only such title as is vested in the aforementioned Substitute Trustee.  WITNESS MY SIGNATURE , this the 2nd day of September, 2016. Sincerely, /s/ Jillian Wilson, WILSON & ASSOCIATES, P.A., Substitute Trustee PREPARED BY: Wilson & Associates, P.A. 1521 Merrill Drive Suite D-220 Little Rock, AR 72211 (501) 219-9388 File # 1106 PUBLISH: 9/13/2016; 9/20/2016; 9/27/2016 1580539\n\t"},
{"page_url": "http://classifieds.sunherald.com/ms/biloxi-foreclosures/substituted-trustees-notice-o/C0A80154162c003CA8pPxSA5A164", "text": "\n\t\tSUBSTITUTED TRUSTEE'S NOTICE OF SALE STATE OF MISSISSIPPI COUNTY OF Harrison 2nd WHEREAS, on the 5th day of June, 2007, Jean R Hayden, single, individual, executed and delivered a certain Deed of Trust unto M Andrew Remson, Trustee for America's Mortgage Resource, Inc, Beneficiary, to secure an indebtedness therein described, which Deed of Trust is recorded in the office of the Chancery Clerk of Harrison 2nd County, Mississippi in Instrument# 2007 4346T-J2; and WHEREAS, on the 5th day of June, 2007, America's Mortgage Resource, Inc, assigned said Deed of Trust unto U.S. Bank, NA, by instrument recorded in the office of the aforesaid Chancery Clerk in Instrument# 2007 5310T-J2; and; WHEREAS, on the 22nd day of August, 2016, the Holder of said Deed of Trust substituted and appointed Emily Kaye Courteau as Substitute Trustee by instrument recorded in the office of the aforesaid Chancery Clerk in Instrument# 2 016-2551 -T-J2; and WHEREAS, default having been made in the payments of the indebtedness secured by the said Deed of Trust, and the holder of said Deed of Trust, having requested the undersigned so to do, on the 29th day of September, 2016, I will during the lawful hours of between 11:00 a.m. and 4:00 p.m., at public outcry, offer for sale and will sell, at the South door of the Harrison 2nd County Courthouse at Biloxi, Mississippi, for cash to the highest bidder, the following described land and property situated in Harrison 2nd County, Mississippi, to-wit: This exhibit is attached to and made a part of that certain Deed of Trust or Mortgage as the case may be executed as of 06/05/07 by Jean R. Hayden to secure that certain promissory note of the same date thereof payable to America's Mortgage Resource, Inc., ISAOA, ATIMA to wit: Lot 57, Cedar Lakes Subdivision, Unit 2, a subdivision located in the Second Judicial District of Harrison County, Mississippi, as per the official map or plat thereof on file and of record in the office of the Chancery Clerk of Harrison County, Mississippi, in the Plat Book 6, Page 6. I will only convey such title as is vested in me as Substitute Trustee. WITNESS MY SIGNATURE, this 30th day of August, 2016. Emily Kaye Courteau Substitute Trustee 855 S Pear Orchard Rd., Ste. 404, Bldg. 400 Ridgeland, MS 39157 (318) 330-9020 rcs/F16-0695 PUBLISH: 9-8-2016 / 9-15-2016 / 9-22-2016 1580401\n\t"},
{"page_url": "http://classifieds.sunherald.com/ms/biloxi-foreclosures/substitute-trustees-notice-of/C0A801801625c03CA4yIV1AF2F22", "text": "\n\t\tSUBSTITUTE TRUSTEE'S NOTICE OF SALE WHEREAS, on December 3, 2010, Barton J. Bosarge and Kathleen L. Bosarge, husband and wife, as joint tenants, executed a deed of trust to Robert W. Kraft, Trustee for the benefit of Mortgage Electronic Registration Systems, Inc. as nominee for Access National Mortgage Corporation, which deed of trust is recorded as Instrument No. 201102964, in Book 2959, Page 378, in the office of the Chancery Clerk of Jackson County, Mississippi; and WHEREAS, said Deed of Trust was assigned to U.S. Bank National Association, recorded as Instrument No. 20151548, in Book 3311, Page 341, of the records of the aforesaid Chancery Clerk; and WHEREAS, U.S. Bank National Association, the holder of the deed of trust, substituted either James L. DeLoach or David E. Flautt as Trustee, as authorized by the terms thereof, by instrument dated July 29, 2016, and recorded and spread at large upon the records in the office of the aforesaid Chancery Clerk as Instrument No. 201612291, in Book 3376, Page 29, prior to the posting and publication of this notice; and WHEREAS, default having been made in the terms and conditions of the deed of trust, and the entire debt secured thereby having been declared to be due and payable in accordance with the terms of the deed of trust, and the legal holder of said indebtedness, U.S. Bank National Association, has requested the undersigned Substitute Trustee to execute the trust and sell said land, property and improvements in accordance with the terms of the deed of trust for the purpose of raising the sums due thereunder, together with attorney's fees, Substitute Trustee's fees and expenses of sale; THEREFORE, on September 28, 2016, the undersigned, as Substitute Trustee in the deed of trust, will offer for sale at public outcry and sell to the highest bidder for cash, within legal hours (being between the hours of 11:00 a.m. and 4:00 p.m.) at the West front door of the Jackson County Courthouse in Pascagoula, Mississippi, the following described land, property and improvements lying and being situate in Jackson County, Mississippi, to-wit: All that parcel of land in Jackson County, State of Mississippi, being known and designated as Lot 155, Lake Forest Estates, Phase IV, filed in Plat Book 23, Page 63, recorded 10/17/2007. As described in deed from Adams Homes, LLC as set forth in Deed Book 1582, Page 514 dated 06/30/2009 and recorded 07/09/2009, Jackson County records, State of Mississippi. I WILL CONVEY only such title as is vested in me as Substitute Trustee. WITNESS MY SIGNATURE, this the 25th day of August, 2016 /s/ David E. Flautt David E. Flautt Substitute Trustee 299 South 9th Street Oxford, MS 38655 (770) 643-2148 Foreclosurehotline.net File No.: 5491715 PUBLISH: September 7, 2016; September 14, 2016; September 21, 2016 1580239\n\t"},
{"page_url": "http://classifieds.sunherald.com/ms/biloxi-foreclosures/substituted-trustees-notice-o/C0A801801625c03CA4hsh1AF2F22", "text": "\n\t\tSUBSTITUTED TRUSTEE'S NOTICE OF SALE WHEREAS, on January 18, 2007, Cham T. Nguyen, A Single Woman, executed a certain deed of trust to CTC Real Estate Services, Trustee for the benefit of Mortgage Electronic Registration Systems, Inc., as nominee for Countrywide Home Loans, Inc., its successors and assigns which deed of trust is of record in the office of the Chancery Clerk of Jackson County, State of Mississippi in Book 2532 at Page 108; and WHEREAS, said Deed of Trust was subsequently assigned to Federal National Mortgage Association by instrument dated October 11, 2012 and recorded in Book 3078 at Page 231 of the aforesaid Chancery Clerk's office; and WHEREAS, Federal National Mortgage Association (\"Fannie Mae\"), a corporation organized and existing under the laws of the United States of America has heretofore substituted Shapiro & Massey, LLC as Trustee by instrument dated August 4, 2016 and recorded in the aforesaid Chancery Clerk's Office in Book 3374 at Page 819; and WHEREAS, default having been made in the terms and conditions of said deed of trust and the entire debt secured thereby having been declared to be due and payable in accordance with the terms of said deed of trust, Federal National Mortgage Association (\"Fannie Mae\"), a corporation organized and existing under the laws of the United States of America, the legal holder of said indebtedness, having requested the undersigned Substituted Trustee to execute the trust and sell said land and property in accordance with the terms of said deed of trust and for the purpose of raising the sums due thereunder, together with attorney's fees, trustee's fees and expense of sale. NOW, THEREFORE, I, Shapiro & Massey, LLC, Substituted Trustee in said deed of trust, will on September 28, 2016 offer for sale at public outcry and sell within legal hours (being between the hours of 11:00 a.m. and 4:00 p.m.), at the Main West Front Door of the County Courthouse of Jackson County, located at Pascagoula, Mississippi, to the highest and best bidder for cash the following described property situated in Jackson County, State of Mississippi, to-wit: Lot 208, Espana Wood Subdivision, Part 7, Jackson County, Mississippi, as per map or plat thereof on file and of record in the office of the Chancery Clerk of Jackson County, Mississippi, in Plat Book 13, Page 11. I WILL CONVEY only such title as vested in me as Substituted Trustee. WITNESS MY SIGNATURE on this 25th day of August, 2016. Shapiro & Massey, LLC SUBSTITUTED TRUSTEE Shapiro & Massey, LLC 1080 River Oaks Drive, Suite B-202 Flowood, MS 39232 (601) 981-9299 6680 Cortez Circle Ocean Springs, MS 39564 16-016967BE Publication Dates: September 7, 14 and 21, 2016 1580311\n\t"},
{"page_url": "http://classifieds.sunherald.com/ms/biloxi-foreclosures/substitute-trustees-notice-of/C0A801801625c03CA4Vso1AF2F22", "text": "\n\t\tSUBSTITUTE TRUSTEE'S NOTICE OF SALE WHEREAS, on August 23, 2007, James Ryan Olsen executed a deed of trust to Harry R. Allen, Trustee for the benefit of Hancock Bank, which deed of trust is recorded in Book 2623, Page 601, as Instrument No. 200728030, in the office of the Chancery Clerk of Jackson County, Mississippi; and WHEREAS, said Deed of Trust was assigned by Hancock Bank to U.S. BANK NATIONAL ASSOCIATION, recorded in Book 2629, Page 459, as Instrument No. 200729565 of the records of the aforesaid Chancery Clerk; and WHEREAS, U.S. BANK NATIONAL ASSOCIATION, the holder of the deed of trust, substituted either James L. DeLoach or David E. Flautt as Trustee, as authorized by the terms thereof, by instrument dated July 27, 2016, recorded and spread at large upon the records in the office of the aforesaid Chancery Clerk in Book 3372, Page 173, as Instrument No. 201611335, prior to the posting and publication of this notice; and WHEREAS, default having been made in the terms and conditions of the deed of trust, and the entire debt secured thereby having been declared to be due and payable in accordance with the terms of the deed of trust, and the legal holder of said indebtedness, U.S. BANK NATIONAL ASSOCIATION, has requested the undersigned Substitute Trustee to execute the trust and sell said land, property and improvements in accordance with the terms of the deed of trust for the purpose of raising the sums due thereunder, together with attorney's fees, Substitute Trustee's fees and expenses of sale; THEREFORE, on September 28, 2016, the undersigned, as Substitute Trustee in the deed of trust, will offer for sale at public outcry and sell to the highest bidder for cash, within legal hours (being between the hours of 11:00 a.m. and 4:00 p.m.) at the main front door of the Jackson County Courthouse in Pascagoula, Mississippi, the following described land, property and improvements lying and being situate in Jackson County, Mississippi, to-wit: Lot 4, Block 3, Eastlawn Sub division, Tract A, Pascagoula, Mississippi, a plat of the Subdivision of part of the Antoine Krebs Private Claim No. 8, Township 8 South, Range 6 West, Jackson County, Mississippi, recorded in Plat Book No. 2 on Pages 7 to 15 in the Office of the Chancery Clerk of the Chancery Court, Jackson County, Mississippi. Less and except and subject to all dedicated, deeded of existing easements for utilities and rights-of-way. I WILL CONVEY only such title as is vested in me as Substitute Trustee. WITNESS MY SIGNATURE, this the 29th day of August, 2016. /s/ David E. Flautt David E. Flautt Substitute Trustee 299 South 9th Street, Suite 205 Oxford, MS 38655 (662) 279-8370 Foreclosurehotline.net File No.: 5162516 PUBLISH: September 7, 2016; September 14, 2016; September 21, 2016 1580328\n\t"},
{"page_url": "http://classifieds.sunherald.com/ms/biloxi-foreclosures/state-of-mississippi-county-of/C0A801801625c03CA4rvL1AF703C", "text": "\n\t\tSTATE OF MISSISSIPPI COUNTY OF HARRISON FIRST JUDICIAL DISTRICT NOTICE OF SUBSTITUTE TRUSTEE'S SALE WHEREAS Rolling Bear, LLC, executed its Deed of Trust to The Citizens Bank of Philadelphia, Beneficiary, filed for record on July 2, 2012, and recorded as Instrument #2 012-6374 T-J1 in the office of the Chancery Clerk of the First Judicial District of Harrison County, Mississippi; and WHEREAS, said Deed of Trust was modified by Modification recorded March 22, 2016, as Instrument #2 016-2263 T-J1 in the office of the Chancery Clerk of the First Judicial District of Harrison County, Mississippi; and WHEREAS, F. Douglas Montague was substituted as Trustee by Appointment of Substitute Trustee recorded August 22, 2016, as Instrument #2 016-7070 T-J1 in the office of the Chancery Clerk of the First Judicial District of Harrison County, Mississippi; and WHEREAS, default has been made in the payment of the indebtedness secured by said Deed of Trust and the holder has declared the full amount due and owing and has requested the undersigned Substitute Trustee to foreclose said Deed of Trust for the purpose of paying said indebtedness; and NOW, THEREFORE, I, F. Douglas Montague, III, Substitute Trustee in said Deed of Trust, will offer for sale and will sell on September 29, 2016, within the hours of 11:00 a.m. and 4:00 p.m., at public outcry to the highest bidder for cash, at the main front door of the First Judicial District of Harrison County Courthouse in Gulfport, Mississippi, the real property situated and being in the First Judicial District of Harrison County, Mississippi, and described on attached Exhibit A. SUBJECT to the prior reservation of all oil, gas and other minerals in, on or under the above described land. SUBJECT to any and all rights-of-way and/or easements for public roads and/or public utilities located on, over and across the above described land as shown by the Land Deed Records on file in the office of the Chancery Clerk of the First Judicial District of Harrison County, Mississippi. I will convey only such title as is vested in me as Substitute Trustee. WITNESS MY SIGNATURE on this, the 1st day of September, A.D., 2016. /s/ F. Douglas Montague, III, Substitute Trustee Publish: September 7, 2016  September 14, 2016   September 21, 2016  September 28, 2016 Exhibit \"A\" Lots 18, 19, 20, 21, 48, 49, 50, 52, 53, 61, 62 and 63, Southampton Town Homes, First Judicial District, HARRISON COUNTY, MISSISSIPPI, together with all improvements lying thereon and all appurtenances thereunto belonging. 1580488\n\t"},
{"page_url": "http://classifieds.sunherald.com/ms/biloxi-foreclosures/substituted-trustees-notice-o/C0A801801625c03CA4KQw1AF2F22", "text": "\n\t\tSUBSTITUTED TRUSTEE'S NOTICE OF SALE STATE OF MISSISSIPPI COUNTY OF Harrison 1st WHEREAS, on the 3rd day of May, 2011, Danny Lee Miller joined herein by Mary Diane Miller, executed and delivered a certain Deed of Trust unto William H. Glover, Jr., Trustee for Wells Fargo Bank, N.A., Beneficiary, to secure an indebtedness therein described, which Deed of Trust is recorded in the office of the Chancery Clerk of Harrison 1st County, Mississippi in Instrument# 2011 4450T-J1; and WHEREAS, Danny Lee Miller joined herein by Mary Diane Miller is also known as Mary Diane Parrish Miller per the land records of Harrison 1st County, Mississippi; and WHEREAS, on the 10th day of December, 2012 the Holder of said Deed of Trust substituted and appointed John C Morris IV as Substitute Trustee by instrument recorded in the office of the aforesaid Chancery Clerk in Instrument# 2012 11947 T-J1; and WHEREAS, on the 1st day of September, 2016 the Hold of said Deed of Trust caused to be recorded a rescission of the previous non-judicial foreclosure sale, said rescission appearing in the office of the aforesaid Chancery Clerk in Instrument#2 016-6158 -D-J1; WHEREAS, default having been made in the payments of the indebtedness secured by the said Deed of Trust, and the holder of said Deed of Trust, having requested the undersigned so to do, on the 28th day of September, 2016, I will during the lawful hours of between 11:00 a.m. and 4:00 p.m., at public outcry, offer for sale and will sell, at the East main door of the Harrison County Courthouse, 1st Judicial District, located on 23rd Avenue at Gulfport, Mississippi, for cash to the highest bidder, the following described land and property situated in Harrison 1st County, Mississippi, to-wit: All that real property located in Harrison County, Mississippi, which is particularly described as follows: A parcel of land situated in a part of the East Half (E 1/2) of the Southwest Quarter (SW 1/4) of the Northwest Quarter (NW 1/4) of Section 6, Township 6 South, Range 9 West, Harrison County, Mississippi, better described as follows: Beginning at the Southeast Corner of the Southwest Quarter (SW 1/4) of the Northwest Quarter (NW 1/4) of Section 6 for a point of beginning; run thence West a distance of 539.7 feet to an iron pipe; run thence North 9 degrees 15 minutes West a distance of 651.2 feet; run thence North 67 Degrees East a distance of 548.6 feet to the south margin of State Highway 57; thence run South 43 Degrees 28 minutes East along said highway a distance of 186.1 feet; thence southerly 704.7 feet to the point of beginning. Contains 10.0 acres. I will only convey such title as is vested in me as Substitute Trustee. WITNESS MY SIGNATURE, this 1st day of September, 2016. John C Morris, IV Substitute Trustee 855 S Pear Orchard Rd., Ste. 404, Bldg. 400 Ridgeland, MS 39157 (318) 330-9020 jeh/F12-2714 PUBLISH: 9/7/2016, 9/14/2016, 9/21/2016 1580481\n\t"},
{"page_url": "http://classifieds.sunherald.com/ms/biloxi-foreclosures/state-of-mississippi-county-of/C0A801801625c03CA4YxV1AF703C", "text": "\n\t\tSTATE OF MISSISSIPPI COUNTY OF HARRISON FIRST JUDICIAL DISTRICT NOTICE OF SUBSTITUTE TRUSTEE'S SALE WHEREAS HamptonBarnard, LLC, executed its Deed of Trust to The Citizens Bank of Philadelphia, Beneficiary, filed for record on April 6, 2010, and recorded as Instrument #2 010-3644 T-J1 in the office of the Chancery Clerk of the First Judicial District of Harrison County, Mississippi; and WHEREAS, said Deed of Trust was modified by Modification recorded February 1, 2012, as Instrument #2 012-1017 T-J1 in the office of the Chancery Clerk of the First Judicial District of Harrison County, Mississippi; and WHEREAS, F. Douglas Montague was substituted as Trustee by Appointment of Substitute Trustee recorded August 31, 2016, as Instrument #2 016-7216 T-J1 in the office of the Chancery Clerk of the First Judicial District of Harrison County, Mississippi; and WHEREAS, default has been made in the payment of the indebtedness secured by said Deed of Trust and the holder has declared the full amount due and owing and has requested the undersigned Substitute Trustee to foreclose said Deed of Trust for the purpose of paying said indebtedness; and NOW, THEREFORE, I, F. Douglas Montague, III, Substitute Trustee in said Deed of Trust, will offer for sale and will sell on September 29, 2016, within the hours of 11:00 a.m. and 4:00 p.m., at public outcry to the highest bidder for cash, at the main front door of the First Judicial District of Harrison County Courthouse in Gulfport, Mississippi, the real property situated and being in the First Judicial District of Harrison County, Mississippi, and described on attached Exhibit A. SUBJECT to the prior reservation of all oil, gas and other minerals in, on or under the above described land. SUBJECT to any and all rights-of-way and/or easements for public roads and/or public utilities located on, over and across the above described land as shown by the Land Deed Records on file in the office of the Chancery Clerk of the First Judicial District of Harrison County, Mississippi. I will convey only such title as is vested in me as Substitute Trustee. WITNESS MY SIGNATURE on this, the 1st day of September, A.D., 2016. /s/ F. Douglas Montague, III, Substitute Trustee Publish: September 7, 2016  September 14, 2016   September 21, 2016  September 28, 2016 Exhibit \"A\" Lots 1, 2, 3, 4, 6, 7, 8, 13, 14, 15, 16, 32, 33, 34, 35, 36 ,37, and 38, Southampton Town Homes, per the map or plat thereof on file in the office of the Chancery Clerk of the First Judicial District of HARRISON COUNTY, MISSISSIPPI, together with all improvements lying thereon and all appurtenances thereunto belonging. 1580489\n\t"},
{"page_url": "http://classifieds.sunherald.com/ms/biloxi-foreclosures/substitute-trustees-notice-of/C0A80154162c003CA8VGpoA5A164", "text": "\n\t\tSUBSTITUTE TRUSTEE'S NOTICE OF SALE WHEREAS, on January 28, 2015, Micheal B. Harrell and Tiffany F. Harrell, executed a deed of trust to Diedre Rhodes, Trustee for the benefit of Navy Federal Credit Union, which deed of trust is recorded as Instrument No. 201501605, in Book 3259, Page 499, in the office of the Chancery Clerk of Jackson County, Mississippi; and WHEREAS, Navy Federal Credit Union, the holder of the deed of trust, substituted either James L. DeLoach or David E. Flautt as Trustee, as authorized by the terms thereof, by instrument dated July 27, 2016, and recorded and spread at large upon the records in the office of the aforesaid Chancery Clerk as Instrument No. 201611336, in Book 3372, Page 176, prior to the posting and publication of this notice; and WHEREAS, default having been made in the terms and conditions of the deed of trust, and the entire debt secured thereby having been declared to be due and payable in accordance with the terms of the deed of trust, and the legal holder of said indebtedness, Navy Federal Credit Union, has requested the undersigned Substitute Trustee to execute the trust and sell said land, property and improvements in accordance with the terms of the deed of trust for the purpose of raising the sums due thereunder, together with attorney's fees, Substitute Trustee's fees and expenses of sale; THEREFORE, on September 29, 2016, the undersigned, as Substitute Trustee in the deed of trust, will offer for sale at public outcry and sell to the highest bidder for cash, within legal hours (being between the hours of 11:00 a.m. and 4:00 p.m.) at the main front door of the Jackson County Courthouse in Pascagoula, Mississippi, the following described land, property and improvements lying and being situate in Jackson County, Mississippi, to-wit: Lot 52, The Sanctuary, Phase Two, a subdivision according to the map or plat thereof on file and of record In the office of the Chancery Clerk of Jackson County, Mississippi In Plat Book 23 at Page 87. I WILL CONVEY only such title as is vested in me as Substitute Trustee. WITNESS MY SIGNATURE, this the 18th day of August, 2016 /s/ James L. DeLoach   James L. DeLoach Substitute Trustee 299 South 9th Street, Suite 205 Oxford, MS 38655 (662) 279-8370 Foreclosurehotline.net      File No.: 5257316 PUBLISH: September 8, 2016; September 15, 2016; September 22, 2016 1579937\n\t"},
{"page_url": "http://classifieds.sunherald.com/ms/biloxi-foreclosures/notice-of-substitute-trustee-/C0A80154162c003CA8vIsLA5A164", "text": "\n\t\tNOTICE OF SUBSTITUTE TRUSTEE' S SALE STATE OF MISSISSIPPI COUNTY OF 1ST DISTRICT HARRISON WHEREAS, default has occurred in the performance of the covenants, terms and conditions of a Deed of Trust dated January 30, 2004, executed by MELINDA A. SMITH, conveying certain real property therein described to CTC REAL ESTATE SERVICES, as Trustee, for MORTGAGE ELECTRONIC REGISTRATION SYSTEMS INC AS NOMINEE FOR COUNTRYWIDE HOME LOANS INC., Original Beneficiary, to secure the indebtedness therein described, as same appears of record in the office of the Chancery Clerk of 1st District Harrison County, Mississippi filed and recorded February 6, 2004, in Deed Book 2805, Page 0155; and WHEREAS, the beneficial interest of said Deed of Trust was transferred and assigned to BANK OF AMERICA, N.A.; and WHEREAS, the undersigned, Rubin Lublin, LLC has been appointed as Substitute Trustee; and NOW, THEREFORE, the holder of said Deed of Trust, having requested the undersigned so to do, as Substitute Trustee or his duly appointed agent, by virtue of the power, duty and authority vested and imposed upon said Substitute Trustee shall, on October 6, 2016 within the lawful hours of sale between 11:00AM and 4:00PM at the front door on the east side of the Courthouse proceed to sell at public outcry to the highest and best bidder for cash or certified funds ONLY, the following described property situated in 1st District Harrison County, Mississippi, to wit: LOT 21, OF THE EXTENSION TO 2ND ADDITION GULFPORT BAYOU VIEW SUBDIVISION TO THE CITY OF GULFPORT, MISSISSIPPI, AS PER MAP OR PLAT THEREOF ON FILE AND OF RECORD IN PLAT BOOK 19, PAGE 21, THE OFFICE OF THE CHANCERY CLERK OF THE FIRST JUDICIAL DISTRICT OF HARRISON COUNTY, MISSISSIPPI. PROPERTY ADDRESS: The street address of the property is believed to be 4490 KENDALL CIRCLE, GULFPORT, MS 39507. In the event of any discrepancy between this street address and the legal description of the property, the legal description shall control. Title to the above described property is believed to be good, but I will convey only such title as is vested in me as Substitute Trustee. THIS LAW FIRM IS ATTEMPTING TO COLLECT A DEBT. ANY INFORMATION OBTAINED WILL BE USED FOR THAT PURPOSE. Rubin Lublin, LLC, Substitute Trustee 428 North Lamar Blvd, Suite 107 Oxford, MS 38655 www.rubinlublin.com/ property-listings.php Tel: (877) 813-0992 Fax: (404) 601-5846 PUBLISH: 09/08/2016, 09/15/2016, 09/22/2016, 09/29/2016 Ad #102865 1580132\n\t"},
{"page_url": "http://classifieds.sunherald.com/ms/biloxi-foreclosures/notice-of-substitute-trustees/C0A80154162c003CA8YwQvA5A164", "text": "\n\t\tNOTICE OF SUBSTITUTE TRUSTEE'S SALE STATE OF MISSISSIPPI COUNTY OF JACKSON WHEREAS, on May 2, 2008, ROBERT TRAVIS TAYLOR, a married man, and ROBERT DALE TAYLOR, a married man, executed a Deed of Trust to Michael L. Riddle, as Trustee for MORTGAGE ELECTRONIC REGISTRATION SYSTEMS, INC., Beneficiary, acting solely as nominee for Lender, its successors and assigns, which is recorded in the Office of the Chancery Clerk of Jackson County, Mississippi, in Book 2706 at Page 509 (Instrument # 200811284) and re-recorded in Book 2785 at Page 16 (instrument # 200904142); and WHEREAS, said Deed of Trust was assigned to TRUSTMARK NATIONAL BANK by Assignment dated March 16, 2016, and recorded in Book 3343 at Page 1 (Instrument # 201604082) in the aforesaid office; and WHEREAS, TRUSTMARK NATIONAL BANK appointed Gerald M. Warren as Substitute Trustee by instrument dated March 16, 2016, and recorded in Book 3343 at Page 4 (Instrument # 201604083) in the aforesaid office; and WHEREAS, default having been made in the payment of the indebtedness secured by said Deed of Trust, which default has continued for a period of time necessary for the holder to declare the entire unpaid balance immediately due and payable, and TRUSTMARK NATIONAL BANK, the holder of the Deed of Trust as aforesaid, having requested the undersigned Substitute Trustee so to do, I will on the 29th day of September, 2016, offer for sale at public outcry and sell during the legal hours, being between the hours of 11:00 o'clock a.m. and 4:00 o'clock p.m., at the West front door of the Jackson County Courthouse, Pascagoula, Mississippi, for cash to the highest and best bidder, the following described land and property lying and being situated in the County of Jackson, State of Mississippi, and more particularly described as follows, towit: Commencing at the Northeast corner of Governmental Lot 2, Fractional Section 8, Township 6 South, Range 4 West, Jackson County, Mississippi, and run thence West a distance of 15 feet; thence run south a distance of 30 feet to a point on the South margin of Cherry Valley Road; thence run West along the South margin of Cherry Valley Road a distance of 480 feet to and for the Point of Beginning; thence continue West along the South margin of said road a distance of 10 feet; thence run South a distance of 532.98 feet; thence run East a distance of 245 feet; thence run North a distance of 177.66 feet; thence run West a distance of 235 feet; thence run North a distance of 355.32 feet to the Point of Beginning. Including a right-of-way from the said Cherry Valley Road to the subject property. I will convey only such title as is vested in me as Substitute Trustee. WITNESS my signature this 23rd day of August, 2016. GERALD M. WARREN, Substitute Trustee Gerald M. Warren Attorney at Law P. O. Box 1506 Gulfport, MS 39502 (228) 897-9975 MS Bar No. 06963 PUBLISHED: September 8, 2016, September 15, 2016 and September 22, 2016. 1580073\n\t"},
{"page_url": "http://classifieds.sunherald.com/ms/biloxi-foreclosures/notice-of-substitute-trustees/C0A801801625c03CA4UlH1AF2F22", "text": "\n\t\tNOTICE OF SUBSTITUTE TRUSTEE'S SALE STATE OF MISSISSIPPI COUNTY OF HARRISON FIRST JUDICIAL DISTRICT WHEREAS, on April 17, 2012, JONATHAN DEAN JENNINGS, a single person, executed a Deed of Trust to Michael L. Riddle, as Trustee for MORTGAGE ELECTRONIC REGISTRATION SYSTEMS, INC., Beneficiary, acting solely as nominee for Lender, its successors and assigns, which is recorded in the Office of the Chancery Clerk of the First Judicial District of Harrison County, Mississippi, bearing Instrument Number 2012 3626 T-J1; and WHEREAS, said Deed of Trust was assigned to TRUSTMARK NATIONAL BANK by Assignment dated December 14, 2015, and recorded as Instrument Number 2015 10859 T-J1 in the aforesaid office; and WHEREAS, TRUSTMARK NATIONAL BANK appointed Gerald M. Warren as Substitute Trustee by instrument dated December 14, 2015, and recorded bearing Instrument Number 2015 10861 T-J1 in the aforesaid office; and WHEREAS, default having been made in the payment of the indebtedness secured by said Deed of Trust, which default has continued for a period of time necessary for the holder to declare the entire unpaid balance immediately due and payable, and TRUSTMARK NATIONAL BANK, the holder of the Deed of Trust as aforesaid, having requested the undersigned Substitute Trustee so to do, I will on the 28th day of September, 2016, offer for sale at public outcry and sell during the legal hours, being be tween the hours of 11:00 o'clock a.m. and 4:00 o'clock p.m., at the East main door of the Harrison County Courthouse located in the City of Gulfport, First Judicial District, State of Mississippi, for cash to the highest and best bidder, the following described land and property lying and being situated in the County of Harrison, First Judicial District, State of Mississippi, and more particularly described as follows, to-wit: Lot Four (4), Block B, BELLEROSE SUBDIVISION, a subdivision according to the official map or plat thereof on file and of record in the Office of the Chancery Clerk of the First Judicial District of Harrison County, Mississippi, in Plat Book 31 at Page 3 thereof, reference to which is hereby made in aid of and as a part of this description. Tax Parcel Number 0412N-01-088.000 I will convey only such title as is vested in me as Substitute Trustee. WITNESS my signature this 24th day of September, 2016. GERALD M. WARREN, Substitute Trustee Gerald M. Warren Attorney at Law P. O. Box 1506 Gulfport, MS 39502 (228) 897-9975 MS Bar No. 06963 PUBLISHED: September 7, 2016, September 14, 2016 and September 21, 2016. 1580129\n\t"},
{"page_url": "http://classifieds.sunherald.com/ms/biloxi-foreclosures/substitute-trustees-notice-of/C0A80155144ac03C9Euiu2D58AC0", "text": "\n\t\tSUBSTITUTE TRUSTEE'S NOTICE OF SALE WHEREAS, on the 7th day of March , 2013, Thomas and Courtney Buffington executed a Deed of Trust to Danny D Jones which named David B Pilger as Trustee, which is recorded in Book 3113 at page 364 in the Office of the Chancery Clerk of Jackson County, Mississippi and according to the terms of the Deed of Trust, Danny D Jones has substituted Gary L Bates in place and instead of David B Pilger and said instrument is recorded in the office of the Chancery Clerk of Jackson County at Pascagoula , Mississippi in Book 3257 at page .766  WHEREAS, default having been made in the terms and conditions of the Deed of Trust and pursuant to the authority granted in his Deed of Trust, Danny D Jones has requested Substitute Trustee Gary L Bates to sell the subject property for the purpose of raising funds to satisfy the debt and the costs of selling the property.  NOW, THEREFORE, Gary L. Bates, Substitute Trustee in said deed of trust will on the 22nd day of September, 2016, offer for sale at public outcry and sell within the legal hours, being between the hours of 11:00 A.M. and 4:00 P.M., at the West front, door of the Jackson County, Mississippi Court House at Pascagoula Mississippi to the highest and best bidder for cash or on such other terms approved by Danny D Jones, the following described property all of which is located in Jackson County Mississippi, to wit: LOTS 10, 11 and 12 OF BLOCK 5 OF PONDAROSA SUBDIVISION Proceeds of the sale to be applied to pay the debt secured by said deed of trust and the cost of executing this trust. Sale will be made subject to any and all prior deeds of trust and liens of record, recorded in the office of the Chancery Clerk of Jackson County, Mississippi. Title to subject property is believed to be good, but I will convey only such title as is vested in me as Substitute Trustee.  WITNESS my signature on this the 25th day of August 2016. GARY L. BATES SUBSTITUTE TRUSTEE gbates@bateslawoffice.com Publication Dates: August 31, September 7, 14 and 21, 2016 1580188\n\t"},
{"page_url": "http://classifieds.sunherald.com/ms/biloxi-foreclosures/substituted-trustees-notice-o/C0A80155144ac03C9ElXq2D549A5", "text": "\n\t\tSUBSTITUTED TRUSTEE'S NOTICE OF SALE WHEREAS, on December 15, 2011, Jeremy W. Owens and Meredith B. Owens, and Wife, as Joint Tenants with Right of Survivorship and Not as Tenants In Common, executed a certain deed of trust to Michael J. Broker, Trustee for the benefit of Mortgage Electronic Registration Systems, Inc., as nominee for USAA Federal Savings Bank, a Federally Chartered Savings Bank, its successors and assigns which deed of trust is of record in the office of the Chancery Clerk of Jackson County, State of Mississippi in Book 3016 at Page 712; and WHEREAS, said Deed of Trust was subsequently assigned to Ocwen Loan Servicing, LLC by instrument dated June 29, 2016 and recorded in Book 3367 at Page 709 of the aforesaid Chancery Clerk's office; and WHEREAS, Ocwen Loan Servicing, LLC has heretofore substituted Shapiro & Massey, LLC as Trustee by instrument dated August 2, 2016 and recorded in the aforesaid Chancery Clerk's Office in Book 3374 at Page 815; and WHEREAS, default having been made in the terms and conditions of said deed of trust and the entire debt secured thereby having been declared to be due and payable in accordance with the terms of said deed of trust, Ocwen Loan Servicing, LLC, the legal holder of said indebtedness, having requested the undersigned Substituted Trustee to execute the trust and sell said land and property in accordance with the terms of said deed of trust and for the purpose of raising the sums due thereunder, together with attorney's fees, trustee's fees and expense of sale. NOW, THEREFORE, I, Shapiro & Massey, LLC, Substituted Trustee in said deed of trust, will on September 28, 2016 offer for sale at public outcry and sell within legal hours (being between the hours of 11:00 a.m. and 4:00 p.m.), at the Main West Front Door of the County Courthouse of Jackson County, located at Pascagoula, Mississippi, to the highest and best bidder for cash the following described property situated in Jackson County, State of Mississippi, to-wit: The following described property: The certain parcel of land shown as Parcel 19 of Graveline Pointe Survey, Phase 1, an undedicated plat recorded in Deed Book 1168, Page 739, on file in the Office of the Chancery Clerk of Jackson County, Mississippi, said Parcel 19 being further described by metes and bounds as follows, to-wit: Commencing at the Northwest corner of Section 6, Township 8 South, Range 7 West, in Jackson County, Mississippi. Thence East for a distance of 2,120.40 feet to a point; Thence South a distance of 1,635.73 feet to a point which lies on the centerline of a 20 foot Drainage Easement and the Point of Beginning of the herein described parcel of land: Thence North 22 degrees 10' 16\" West for a distance of 295.26 feet to a point; Thence South 44 degrees 38' 64\" West for a distance of 321.26 feet to a point which lies on the East right-of-way line of Olde Oak Pointe cul-de-sac; Thence along a curve to the right having a radius of 52.00 feet, an arc length of 96.58 feet and a chord bearing and distance of South 07 degrees 08' 38\" West 82.68 feet to a point, Thence South 05 degrees 12' 00\" West along the said East right-of-way of Olde Oak Pointe for a distance of 43.71 feet to a point said point also being on the centerline of a 20 foot Drainage Easement; Thence North 78 degrees 24' 00\" East along said centerline of a Drainage Easement for a distance of 364.39 feet back to the point of beginning as shown on Survey attached hereto as Exhibit \"A\" and made a part thereof. Subject to that part of a 20 foot wide Drainage Easement along the Southern Lot line, as shown on Graveline Pointe Survey, Phase 1, an undedicated plat recorded in Deed Book 1168, Page 739, on file in the Office of the Chancery Clerk of Jackson County, Mississippi. For the same considerations hereinabove recited, the Grantors also sell, convey, and quitclaim unto the Grantee herein the following described, tract, piece or parcel of land, particularly described as follows, to-wit: Commencing at the Northwest corner of Section 5, Township 8 South, Range 7 West, in Jackson County, Mississippi. Thence East for a distance of 2,120.40 feet to a point; Thence South a distance of 1,635.73 feet to the point of beginning. Thence North 22 degrees 10' 16\" West for a distance of 295.26 feet to a point; Thence North 53 degrees 55' 11\" East for a distance of 42.15 feet to the West edge of a Bayou, Thence in a Southeasterly direction along the meanderings of said West Bank of Bayou for a distance of 457.68 feet to a point that lies North 37 degrees 18' 57\" West for a distance of 71.01 feet back the point of beginning. This property is conveyed by Quitclaim only and part or all may be below the watermark of ordinary high tide and may otherwise constitute \"Coastal Wetlands\" as defined in the Coastal Wetlands Protection Law. Such a riparian and littoral rights as are owned by the Grantor in this parcel are conveyed herewith without any warranty as to their existence, nature or extent. Excepting therefrom all oil, gas, minerals and other hydrocarbon substances below a depth of 500 feet, without rights of surface entry, as reserved in Instruments or record. This conveyance is subject to the terms, conditions and restrictions contained in that certain right-of-way Easement from James Reeves Development, Inc., a Mississippi Corporation, to future parcel owners dated March 29, 1999, recorded in Deed Book 1168, Pages 858-861 and Corrected Right-Of-Way Easement, recorded in Deed Book 1180, Page 108-111, Land Deed Records of Jackson County, Mississippi. The Grantor herein does hereby grant and convey, subject to the terms, conditions and restrictions contained therein, unto the Grantee herein, the non-exclusive right of ingress and egress over and across said easement for the purpose of access to the property conveyed hereby. Assessor's Parcel No: 02505020.108 I WILL CONVEY only such title as vested in me as Substituted Trustee. WITNESS MY SIGNATURE on this 16th day of August, 2016. Shapiro & Massey, LLC SUBSTITUTED TRUSTEE Shapiro & Massey, LLC 1080 River Oaks Drive Suite B-202 Flowood, MS 39232 (601) 981-9299 2404 Olde Oak Point Ocean Springs, MS 39564 16-016527BE Publication Dates: August 31, September 7, 14 and 21, 2016 1580183\n\t"},
{"page_url": "http://classifieds.sunherald.com/ms/biloxi-foreclosures/substitute-trustees-notice-of/C0A801541600403C9AWpxuF30F27", "text": "\n\t\tSUBSTITUTE TRUSTEE'S NOTICE OF FORECLOSURE SALE WHEREAS, on June 22, 1998, Esther Lott executed a certain deed of trust to Stephen R. Colson, Trustee for the use and benefit of NF Investments, INC., which deed of trust is of record in the office of the Chancery Clerk of Harrison, County, state of Mississippi, in Book 1882, Page 361; and  WHEREAS, The Bank of New York Mellon f/k/a The Bank of New York as successor in interest to JPMorgan Chase Bank, National Association, as Trustee for C-BASS Mortgage Loan Asset-Backed Certificates, Series 2006-RP1, the current holder and/or assignee, substituted Jauregui & Lindsey, LLC as Trustee by instrument recorded in the Chancery Clerk's Office on August 5, 2014 in Instrument, 2014 6134T-J1; and  WHEREAS, Default having been made in the terms and conditions of said deed of trust and the entire debt secured thereby having been declared to be due and payable in accordance with the terms of said deed of trust, The Bank of New York Mellon f/k/a The Bank of New York as successor in interest to JPMorgan Chase Bank, National Association, as Trustee for C-BASS Mortgage Loan Asset-Backed Certificates, Series 2006-RP1, the legal holder of said indebtedness, having requested the undersigned Substitute Trustee in said deed of trust, will on September 27, 2016 offer for sale at public outcry and sell within legal hours (being between the hours of 11:00 a.m. and 4:00 p.m.), at the main front door of the County Courthouse of Harrison County in Gulfport, Mississippi, to the highest and best bidder for cash the following described property situated in Harrison County, Mississippi, to wit: Lot 87, BEL-AIRE SUBDIVISION, 7TH ADDITION, being a subdivision located in the First Judicial District of Harrison County, Mississippi, as per map or plat thereof on file and of record in the office of the Chancery Clerk of Harrison County, Mississippi.  I will convey only such title as vested in me as Substituted Trustee. Jauregui & Lindsey, LLC Substituted Trustee Jauregui & Lindsey, LLC 244 Inverness Center Dr Ste 200 Birmingham, AL 35242 (205) 970-2233 Publication dates: September 1, 2016, September 8, 2016, September 15, 2016, September 22, 2016 1580191\n\t"},
{"page_url": "http://classifieds.sunherald.com/ms/biloxi-foreclosures/state-of-mississippi-county-of/C0A801541600403C9ANxSTF30F27", "text": "\n\t\tSTATE OF MISSISSIPPI COUNTY OF HARRISON SUBSTITUTE TRUSTEE'S NOTICE OF SALE WHEREAS, Keith E. Lively, Sr. and Donna Crosby a/k/a Donna Crosby Lively, as Grantors, being indebted to Hancock Bank, executed and delivered that certain Deed of Trust to Hancock Bank, as Lender/Beneficiary and Joy Lambert Phillips, as Trustee, for the benefit of Hancock Bank, Lender, dated August 30, 2010, and recorded on September 13, 2010 as Instrument No. 2010 3276T-J2 in the office of the Chancery Clerk of Harrison County, Second Judicial District, Mississippi (the \"Deed of Trust\"); and WHEREAS, Whitney Bank, a Mississippi state chartered bank, formerly known as Hancock Bank, a Mississippi state chartered bank, is the present owner and holder of the Deed of Trust and has substituted John M. Harral, as Substitute Trustee therein, as authorized by the terms of said Deed of Trust, by instrument dated August 12, 2016, and recorded on August 17, 2016 as Instrument No. 2016 2409T-J2 of the land records of the aforesaid Chancery Clerk; and WHEREAS, default having been made in the terms and conditions of the Deed of Trust and the entire debt secured thereby having become due and payable in accordance with the terms of the indebtedness and the Deed of Trust, and the legal owner and holder of said indebtedness, Whitney Bank, having requested the undersigned Substitute Trustee to execute the trust and sale of the land and property described in the Deed of Trust and in accordance with the terms of the Deed of Trust for the purpose of raising the sums due thereunder, together with attorney's fees, Substitute Trustee's fees and expenses of sale; NOW, THEREFORE, notice is hereby given that I, John M. Harral, Substitute Trustee in the Deed of Trust, will on Friday, the 23rd day of September, 2016, offer for sale and will sell at public sale and outcry, to the highest and best bidder for cash during legal hours at the front doors of the Harrison County Courthouse in Biloxi, Mississippi, the following described real property situated and lying in the Second Judicial District of Harrison County, State of Mississippi and commonly known as 12027 Motsie Circle, Biloxi, MS 39532, and more particularly described as: PARCEL 1: From the NW comer of the SW 1/4 of Section 5 T-7-S, R-9-W, run S-0-13W distance of 798 feet; thence running -89-47' W a distance of 245 feet to a point of beginning. From said point of beginning run Northwesterly along the West margin of Motsie Circle a distance of 60 feet to an iron pipe; thence running N82-07' W a distance of 82 feet to an iron pipe and continuing along this same line a distance of 25 feet more or less to the water's edge; thence run Southerly along the East margin of Tchoutacabouffa River a distance of 62 feet more or less to a point, thence running S-84-32 E a distance of 23 feet more or loss to an iron pipe; thence continue along this same line a distance of 99 feet to the said point of beginning. PARCEL 2: From the NE corner of the SE 1/4 of the SE 1/4 of Section 6, T-7-S, R-9-W, Harrison County, Mississippi, run S 13 degrees 25' W 777.44 feet to a point on a private road for the point of beginning. From this point of beginning, run: N 30 degrees 18' W 59.75 feet along the East margin of the private road, N 49 degrees 25' E 96.0 feet more or less to the water's edge of a lake, Southerly 27.6 feet more or less along the water's edge, S 29 degrees 55' W 101.0 feet to the point of beginning. PARCEL 3: A parcel of land located in the SE 1/4 of the SE 1/4 of Section 6, Township 7 South, Range 9 West, Harrison County, Mississippi, being more particularly described as: Commencing at the NW corner of the SW 1/4 of the SW 1/4 of Section 5, Township 7 South, Range 9 West, Harrison County, Mississippi; thence run S 05 degrees 50' E for 596.43 feet to an iron pin; thence run S 70 degrees 42' E for 30.0 feet to an iron pin; thence run S 19 degrees 18' W for 120.99 feet to an iron pin; thence run S 56 degrees 39' W for 41.44 feet to an iron pin; thence run S 58 degrees 37' 13\" W for 21.08 feet to an iron pin; thence run S 77 degrees 03' W 67.0 feet to an iron pin; thence run S 43 degrees 14' W for 81.0 feet to an iron pin; thence run S 35 degrees 16' 20\" W for 56.7 feet to an iron pin; thence run S 22 degrees 21' 20\" W for 24.22 feet to an iron pin; thence run S 46 degrees 07' 44\" W for 39.95 feet to an iron pin; thence run N 59 degrees 40' 15\" W 44.05 feet to an iron pin; thence run N 17 degrees 49' 05\" E for 40.65 feet to the Point of Beginning. Thence run N 19 degrees 18' 05\" W for 59.12 feet to an iron pin; thence run N 14 degrees 24' 40\" W 60.06 feet to an iron pin, thence run N 01 degrees 37' 40\" W for 60.14 feet to an iron pin; thence run N 12 degrees 28' 55\" W for 87.4 feet to an iron pin; thence run S 88 degrees 49' 30\" E 21.94 feet to an iron pin; thence run N 87 degrees 14' E for 22.0 feet to an iron pin; thence run S 05 degrees 32' W for 30.12 feet to an iron pin; thence run S 18 degrees 17' E for 77.78 feet to an iron pin; thence run S 30 degrees 18' E for 59.75 feet to an iron pin; thence run S 21 degrees 26' W 39.3 feet to a point on the South margin of an existing dirt drive; thence run along the margin of the existing dirt drive S 68 degrees 34' E 39.3 feet to a point; thence run S 43 degrees 22' 42\" W for 103.67 feet to the Point of Beginning. Subject to a variable width road easement for ingress and egress previously granted to owners of property adjacent to above described property. Together with rights of ingress and egress to the properties above described over and across that certain easement from Charlotte d'heur of record in Book 378, Pages 210-212 of the Deed Records of Harrison County, Mississippi, as well as the use of the 30 foot roadways known as Lynn Drive and Motsie Circle as presently laid out and delineated. LESS AND EXCEPT: A 10' strip conveyed to Lewis C. Drawdy more particularly described as follows: A ten (10') foot strip adjacent to the Northern most border of the hereinbelow described parcel of real property, being more particularly described as a 10' strip lying immediately south of and running parallel to the following two runs as stated in the description of said parcel: \"thence run S 88 degrees 49 minutes 30 seconds East 21.94 feet to an iron pin; thence run N 87 degrees 14 minutes East 22' to an iron pin\", with the said southern most line of the 10' strip terminating on the East side on that particular run described as \"thence run North 12 degrees 28 minutes 55 seconds West for 87.4 feet to an iron pin\" and terminating on the West on that particular run described as, \"thence run South 05 degrees 32 minutes West for 30.12 feet to an iron pin [.]\" Said 10 foot (10') strip being a part of the hereinbelow described property, said parcel being the same property designated as Parcel 3 in that certain Quitclaim Deed from Donna L. Parker to Johnny D. Parker dated October 11, 2002, and filed in Deed Book 393 Page 275 in the office of the Chancery Clerk of the Second Judicial District of Harrison County, Mississippi. Commencing at the NW corner of the SW 1/4 of the SW 1/4 of Section 5, Township 7 South, Range 9 West, Harrison County, Mississippi; thence run S 05 degrees 50 minutes E for 596.43 feet to an iron pin; thence run S 70 degrees 42 minutes E 30.0 feet to an iron pin; thence run S 19 degrees 18 minutes W for 120.99 feet to an iron pin; thence run S 56 degrees 39 minutes W for 41.44 feet to an iron pin; thence run S 58 degrees 37 minutes 13 seconds W for 21.08 feet to an iron pin; thence run S 77 degrees 03 minutes West 67.0 feet to an iron pin; thence run S 43 degrees 14 minutes W for 81.0 feet to an iron pin; thence run S 35 degrees 16 minutes 20 seconds W for 56.7 feet to an iron pin; thence run S 22 degrees 21 minutes 20 seconds W for 24.22 feet to an iron pin; thence run S 46 degrees 07 minutes 44 seconds W for 39.95 feet to an iron pin; thence run N 59 degrees 40 minutes 15 seconds W 44.05 feet to an iron pin; thence run N 17 degrees 49 minutes 05 seconds E for 40.65 feet to the Point of Beginning. Thence run N 19 degrees 18 minutes 05 seconds W for 59.12 feet to an iron pin; thence run N 14 degrees 24 minutes 40 seconds W 60.06 feet to an iron pin; thence run N 01 degrees 37 minutes W for 60.14 feet to an iron pin; thence run N 12 degrees 28 minutes 55 seconds W for 87.4 feet to an iron pin; thence run S 88 degrees 49 minutes 30 seconds E 21.94 feet to an iron pin; thence run N 87 degrees 14 minutes E for 22.0 feet to an iron pin; thence run S 05 degrees 32 feet W for 30.12 feet to an iron pin; thence run S 18 degrees 17 minutes E for 77.78 feet to an iron pin; thence run S 30 degrees 18 minutes E for 59.75 feet to an iron pin; thence run S 21 degrees 26 minutes W 39.3 feet to a point on the South margin of an existing dirt drive; thence run along the margin of the existing dirt drive S 68 degrees 34 minutes E 39.3 feet to a point; thence run S 43 degrees 22 minutes 42 seconds W for 103.67 feet to the Point of Beginning. Subject to a variable width road easement for ingress and egress previously granted to owner's of property adjacent to above described property. As an aid to the description of the 10' strip being convoyed out of the description immediately hereinabove, the Northern most border runs are underlined and the intersecting runs for the Southern most border of the 10' strip as italics. COLLAPSED PROPERTY LINES: WHEREAS, the aforementioned property descriptions are hereby being collapsed to form a new property description which encompasses all said property and shall hereafter be described as follows: Survey of a parcel of land in the SE 1/4 of the SE 1/4 of Section 6, Township 7 South, Range 9 West, City of Biloxi, Second Judicial District of Harrison County, Mississippi, and being more particularly described as follows: Commencing at the northeast corner of said SE 1/4 of the SE 1/4 of Section 6; thence S 05 degrees 50' 00\" E 596.43 feet to a point; thence S 70 degrees 42' 00\" E 30.00 feet to a point; thence S 19 degrees 18' 00\" W 120.99 feet to a point; thence S 56 degrees 39' 00\" W41.44 feet to a point; thence S 58 degrees 37' 13\" 21.08 feet to a point; thence S 77 degrees 03' 00\" W 67.00 feet to a point; thence S 43 degrees 14' 00\" W 81.00 feet to a point; thence S 35 degrees 16' 20\" W 56.7 feet to a point; thence S 22 degrees 21' 20\" W 24.22 feet to a point; thence S 46 degrees 07' 44\" W 39.95 feet to a point; thence N 59 degrees 40' 15\" W 44.05 feet to a point; thence N 17 degrees 49' 05\" E 40.65 feet to a 1/2\" rebar found at the POINT OF BEGINNING; thence N 18 degrees 22' 57' W 59.12 feet to a 1/2\" rebar found; thence N 84 degrees 32' 00\" W 122.47 feet to a 1/2\" rebar found; thence continue N 84 degrees 32' 00\" W 11.56 feet to the water's edge of the east margin of the Tchoutacabouffa River; thence N 00 degrees 14' 57\" E 37.16 feet along said water's edge; thence N 11 degrees 47' 11\" E 26.38 feet further along said water's edge; thence S 81 degrees 09' 00\" E 16.78 feet to a 1\" pipe found; thence continue S 81 degrees 09' 00\" E 97.94 feet to a 1/2\" rebar set; thence N 00 degrees 56' 29\" W 60.04 feet to a 1/2\" rebar found; thence N 10 degrees 42' 49\" W 76.93 feet to a 1/2\" rebar set; thence S 87 degrees 29' 49\" E 18.38 feet to a 1/2\" rebar set; thence N 88 degrees 37' 21\" E 21.53 feet to a 1/2\" rebar set; thence S 04 degrees 32' 50\" W 20.59 feet to a 1/2\" rebar found; thence S 16 degrees 36' 05\" E 76.71 feet to a 1/2\" rebar found; thence N 49 degrees 32' 00\" E 90.00 feet to a 1/2\" rebar set; thence continue N 49 degrees 32' 00\" E 3.25 feet to the water's edge of a canal; thence S 19 degrees 16' 41\" E 26.49 feet along said water's edge of a canal to a point; thence S 29 degrees 55' 00\" W 5.73 feet to a 1/2\" rebar set; thence continue S 29 degrees 55' 00\" W 95.00 feet to a 1\" pipe found; thence S 27 degrees 45' 27\" W 16.05 feet to a mag nail set; thence S 68 degrees 31' 41\" E 39.06 feet to a 1/2\" rebar found; thence S 42 degrees 51' 22\" W 103.67 feet to the POINT OF BEGINNING. Said parcel of land is subject to an existing variable width road easement for ingress and egress granted to owners of property adjacent to the above described property. I WILL CONVEY only such title as is vested in me as Substitute Trustee, this sale being subject to any and all liens and other encumbrances having priority over the Deed of Trust. WITNESS MY SIGNATURE this the 29th day of August, 2016.      /s/ John M. Harral    John M. Harral, Substitute Trustee Publish: September 1, 2016 September 8, 2016 September 15, 2016 September 22, 2016 POSTED: Harrison County Courthouse Biloxi, Mississippi On or before the 1st day of September, 2016 1580236\n\t"},
{"page_url": "http://classifieds.sunherald.com/ms/biloxi-foreclosures/substituted-trustees-notice-o/C0A801541600403C9AvUWRF30F27", "text": "\n\t\tSUBSTITUTED TRUSTEE'S NOTICE OF SALE WHEREAS, on October 13, 2006, Jesse Hearin, III, single man, executed a certain deed of trust to Nations Title, Trustee for the benefit of Mortgage Electronic Registration Systems, Inc., as nominee for Primary Residential Mortgage Inc., its successors and assigns which deed of trust is of record in the office of the Chancery Clerk of Harrison County, State of Mississippi in Instrument No. 2006 23993 T-J1; and WHEREAS, said Deed of Trust was subsequently assigned to Federal National Mortgage Association by instrument dated February 13, 2014 and recorded in Instrument No. 2014 1383 T-J1 of the aforesaid Chancery Clerk's office; and WHEREAS, Federal National Mortgage Association (\"Fannie Mae\"), a corporation organized and existing under the laws of the United States of America has heretofore substituted Shapiro & Massey, LLC as Trustee by instrument dated August 4, 2016 and recorded in the aforesaid Chancery Clerk's Office in Instrument No. 2016 6669 T-J1; and WHEREAS, default having been made in the terms and conditions of said deed of trust and the entire debt secured thereby having been declared to be due and payable in accordance with the terms of said deed of trust, Federal National Mortgage Association (\"Fannie Mae\"), a corporation organized and existing under the laws of the United States of America, the legal holder of said indebtedness, having requested the undersigned Substituted Trustee to execute the trust and sell said land and property in accordance with the terms of said deed of trust and for the purpose of raising the sums due thereunder, together with attorney's fees, trustee's fees and expense of sale. NOW, THEREFORE, I, Shapiro & Massey, LLC, Substituted Trustee in said deed of trust, will on September 29, 2016 offer for sale at public outcry and sell within legal hours (being between the hours of 11:00 a.m. and 4:00 p.m.), at the East Main Door of the County Courthouse of Harrison County, located at Gulfport, Mississippi, to the highest and best bidder for cash the following described property situated in Harrison County, State of Mississippi, to-wit: Lot Thirty-Nine (39), Tiny Acres Subdivision, a subdivision according to the official map or plat thereof on file and of record in the Office of the Chancery Clerk of the First Judicial District of Harrison County, Mississippi, in Plat Book 33 at Page 2 thereof, reference to which is hereby made in aid of and as a part of this description. I WILL CONVEY only such title as vested in me as Substituted Trustee. WITNESS MY SIGNATURE on this 25th day of August, 2016. Shapiro & Massey, LLC SUBSTITUTED TRUSTEE Shapiro & Massey, LLC 1080 River Oaks Drive, Suite B-202 Flowood, MS 39232 (601) 981-9299 22367 Derrick Road Pass Christian, MS 39571 16-016891BE Publication Dates: Sept ember 1, 8, 15 and 22, 2016 1580238\n\t"},
{"page_url": "http://classifieds.sunherald.com/ms/biloxi-foreclosures/substitute-trustees-notice-of/C0A801551606803CA1lGHO2D6839", "text": "\n\t\tSUBSTITUTE TRUSTEE'S NOTICE OF SALE WHEREAS, on March 20, 2007, David W. Johnson and Karen R. Johnson executed a deed of trust to Ronald L. Whittington, Trustee for the benefit of Pike National Bank, which deed of trust is recorded as Instrument No. 2 007-6335 -T-J1 in the office of the Chancery Clerk of the First Judicial District of Harrison County, State of Mississippi, pertaining to the following described property situated in said County and State, to-wit: Lots 12, 13, 14 and 15, Block 10, Hewes Addition, City of Gulfport, First Judicial District of Harrison County, Mississippi, as per the official map or plat thereof on file and of record in the Office of the Chancery Clerk there, Plat Book 3 at page 10. WHEREAS, by Assignment, dated August 30, 2007, said Pike National Bank assigned its interest in said deed of trust to Pikco Finance, Inc., a Mississippi corporation, which Assignment is recorded as Instrument Number 2 007-1829 3-T-J1 in the office of the Chancery Clerk of the First Judicial District of Harrison County, State of Mississippi; and WHEREAS, by Assignment, dated May 17, 2010, said Pikco Finance, Inc. assigned its interest in said deed of trust to said Pike National Bank, which Assignment is recorded as Instrument Number 2 010-5680 -T-J1 in the office of the Chancery Clerk of the First Judicial District of Harrison County, State of Mississippi; and WHEREAS, on August 17, 2011, David W. Johnson and Karen R. Johnson executed a Renewal and Extension Deed of Trust to Ronald L. Whittington, Trustee for the benefit of Pike National Bank, which deed of trust is recorded as Instrument No. 2 011-8282 -T-J1 in the office of the Chancery Clerk of the First Judicial District of Harrison County, State of Mississippi, renewing and extending the deed of trust recorded as Instrument No. 2007-6335-T-J1; and WHEREAS, under the terms of said deed of trust, the beneficiary is authorized and empowered to appoint and substitute another trustee in the place and stead of the trustee named therein, at any time by writing duly signed and acknowledged and recorded in the County where said property is located; and WHEREAS, said Pike National Bank, the legal holder of the said Deed of Trust and note secured thereby, substituted Ronald Andrew Marion, Jr., as Trustee therein, as authorized by the terms thereof, by instrument recorded in the office of the aforesaid Chancery Clerk as Instrument No. 2 016-7249 -T-J1; and WHEREAS, default having been made in the performance of the conditions and stipulations as set forth by said Deed of trust, and having been requested by the legal holder of the indebtedness secured and described by said Deed of Trust so to do, notice is hereby given that I, the undersigned Ronald Andrew Marion, Jr., do hereby give notice that on September 23, 2016, during legal hours of sale, (between the hours of 11:00 a.m. and 4:00 p.m.) I will proceed to sell at public auction, at public outcry, to the highest and best bidder for cash at the East front door of the Harrison County Court house, First Judicial District, in Gulfport, Mississippi, the following described lands with all improvements thereon situated in the First Judicial District, Harrison County, Mississippi, described as follows, to-wit:  Lots 12, 13, 14 and 15, Block 10, Hewes Addition, City of Gulfport, First Judicial District of Harrison County, Mississippi, as per the official map or plat thereof on file and of record in the Office of the Chancery Clerk there, Plat Book 3 at page 10. I will convey only such title as is vested in me as Substitute Trustee. WITNESS my signature, this the 29th day of August, 2016. Ronald Andrew Marion, Jr. Substitute Trustee Publish: September 2, 2016; September 9, 2016 and September 16, 2016 Prepared by: Ronald Andrew Marion, Jr. / MSB # 1866 P.O. Box 863 Gulfport, MS 39502 (228) 865-9047 1580242\n\t"},
{"page_url": "http://classifieds.sunherald.com/ms/biloxi-foreclosures/substituted-trustees-notice-o/C0A801551606803CA1VLMU2D6839", "text": "\n\t\tSUBSTITUTED TRUSTEE'S NOTICE OF SALE WHEREAS, on November 23, 2005, Billy Ray Barnes and Jenny L. Barnes, husband and wife executed a certain deed of trust to Atty. Arnold M. Weiss, Trustee for the benefit of Mortgage Electronic Registration Systems, Inc. as nominee for Homecoming Financial Network, Inc., its successors and assigns which deed of trust is of record in the office of the Chancery Clerk of Harrison County, State of Mississippi in Instrument No. 2005 13606T-J2; and WHEREAS, said Deed of Trust was subsequently assigned to U.S. Bank National Association as Trustee for RASC 2006KS1 by instrument dated February 2, 2009 and recorded in Instrument No. 2009 467T-J2 of the aforesaid Chancery Clerk's office; and WHEREAS, U.S. Bank National Association, as Trustee for Residential Asset Securities Corporation, Home Equity Mortgage AssetBacked Pass-Through Certificates, Series 2006-KS1being one and the same as U.S. Bank National Association as Trustee for RASC 2006KS1 has heretofore substituted Shapiro & Massey, LLC as Trustee by instrument dated January 21, 2016 and recorded in the aforesaid Chancery Clerk's Office in Instrument No. 2016 275T-J2; and WHEREAS, default having been made in the terms and conditions of said deed of trust and the entire debt secured thereby having been declared to be due and payable in accordance with the terms of said deed of trust, U.S. Bank National Association, as Trustee for Residential Asset Securities Corporation, Home Equity Mortgage AssetBacked Pass-Through Certificates, Series 2006-KS1, the legal holder of said indebtedness, having requested the undersigned Substituted Trustee to execute the trust and sell said land and property in accordance with the terms of said deed of trust and for the purpose of raising the sums due thereunder, together with attorney's fees, trustee's fees and expense of sale. NOW, THEREFORE, I, Shapiro & Massey, LLC, Substituted Trustee in said deed of trust, will on September 23, 2016 offer for sale at public outcry and sell within legal hours (being between the hours of 11:00 a.m. and 4:00 p.m.), at the South Front Door of the County Courthouse of Harrison County, located at Biloxi, Mississippi, to the highest and best bidder for cash the following described property situated in Harrison County, State of Mississippi, to-wit: Being a tract of land siuated in Harrison County, Mississippi, and being more particularly described as follows, to-wit: THAT CERTAIN PROPERTY LOCATED IN HARRISON COUNTY AS TO WIT: LOT TWELVE (12), BLOCK ONE (1) BEVERLY HILLS SUBDIVISION, ACCORDING TO THE OFFICIAL MAP OR PLAT THEREOF ON FILE AND OF RECORD IN THE OFFICE OF THE CHANCERY CLERK OF HARRISON COUNTY, MISSISSIPPI. RECORDED IN BOOK 60, PAGE 208.0. I WILL CONVEY only such title as vested in me as Substituted Trustee. WITNESS MY SIGNATURE on this 24th day of August, 2016. Shapiro & Massey, LLC SUBSTITUTED TRUSTEE Shapiro & Massey, LLC 1080 River Oaks Drive Suite B-202 Flowood, MS 39232 (601) 981-9299 1642 Hollywood Blvd. Biloxi, MS 39531 15-015073AH Publication Dates: September 2, 9 and 16, 2016 1580241\n\t"},
{"page_url": "http://classifieds.sunherald.com/ms/biloxi-foreclosures/substitute-trustees-notice-of/C0A80154161f803C9AhKI21C55D0", "text": "\n\t\tSUBSTITUTE TRUSTEE'S NOTICE OF SALE WHEREAS, on March 13, 2007, Barney J. Cannaday and Maria A. Cannaday, Husband and Wife, executed a deed of trust to Prestige Title, Inc., Trustee for the benefit of Mortgage Electronic Registration Systems, Inc. as nominee for Greater United Home Funding, Inc., a Florida Corporation, which deed of trust is recorded as Instrument No. 2 007-6478 T-J1 in the office of the Chancery Clerk of the First Judicial District of Harrison County, Mississippi; and WHEREAS, said Deed of Trust was assigned by Mortgage Electronic Registration Systems, Inc., as nominee for Greater United Home Funding, Inc., a Florida Corporation, its successors and assigns, to JPMorgan Chase Bank, National Association, by instrument dated January 19, 2013, and recorded as Instrument No. 2 013-1802 T-J1 of the records of the aforesaid Chancery Clerk; and WHEREAS, JPMorgan Chase Bank, National Association, the holder of the deed of trust, substituted either James L. DeLoach or David E. Flautt as Trustee, as authorized by the terms thereof, by instrument dated May 24, 2016, and recorded and spread at large upon the records in the office of the aforesaid Chancery Clerk as Instrument No. 2 016-4299 T-J1, prior to the posting and publication of this notice; and WHEREAS, default having been made in the terms and conditions of the deed of trust, and the entire debt secured thereby having been declared to be due and payable in accordance with the terms of the deed of trust, and the legal holder of said indebtedness, JPMorgan Chase Bank, National Association, has requested the undersigned Substitute Trustee to execute the trust and sell said land, property and improvements in accordance with the terms of the deed of trust for the purpose of raising the sums due thereunder, together with attorney's fees, Substitute Trustee's fees and expenses of sale; THEREFORE, on October 27, 2016, the undersigned, as Substitute Trustee in the deed of trust, will offer for sale at public outcry and sell to the highest bidder for cash, within legal hours (being between the hours of 11:00 a.m. and 4:00 p.m.) at the East front door of the Harrison County Courthouse in Gulfport, Mississippi, the following described land, property and improvements lying and being situate in the First Judicial District of Harrison County, Mississippi, to-wit: LOT 56, WEST FOREST ESTATES, AS PER OFFICIAL MAP OR PLAT THEREOF ON FILE AND OF RECORD IN THE OFFICE OF THE CHANCERY CLERK OF HARRISON COUNTY, FIRST JUDICIAL DISTRICT, MISSISSIPPI. TOGETHER WITH THAT 2006 CHAMPION MODEL CV448 DOUBLEWIDE MANUFACTURED HOME WITH A LENGTH OF 76' AND A WIDTH OF 14'6\" BEARING IDENTIFICATION NUMBER 021-0131 06AB000-H. A.P.N.: 0605-02-025.056 I WILL CONVEY only such title as is vested in me as Substitute Trustee. WITNESS MY SIGNATURE, this the 24th day of August, 2016 /s/ David E. Flautt   David E. Flautt Substitute Trustee 299 South 9th Street, Suite 205 Oxford, MS 38655 (662) 279-8370 Foreclosurehotline.net File No.: 5162316 PUBLISH: October 6, 2016; October 13, 2016; October 20, 2013 1580130\n\t"},
{"page_url": "http://classifieds.sunherald.com/ms/biloxi-foreclosures/special-commissioners-notice-/C0A80154161f803C9AQWo21C55D0", "text": "\n\t\tSPECIAL COMMISSIONER'S NOTICE OF SALE WHEREAS, on March 31, 2009, Exavier C. Niolet Jr. and Marie Niolet executed a Deed of Trust to Joy Lambert Phillips, Trustee for the benefit of Hancock Bank, which Deed of Trust is filed for record on April 16, 2009, as Instrument No. 2009 5076T-J1 in the office of the Chancery Clerk of Harrison County, at Gulfport, Mississippi, and which Deed of Trust was modified by Modification of Deed of Trust, dated August 6, 2013, and filed for record on June 16, 2013, as Instrument 2013 8864T-J1 in the office of the aforesaid Chancery Clerk (collectively, the \"Deed of Trust\"); and WHEREAS, Whitney Bank, a Mississippi state chartered bank, formerly known as Hancock Bank, a Mississippi state chartered bank, filed its Complaint For Declaratory Judgment And Judicial Foreclosure (\"Complaint\") in Civil Action No. 16-1084(1) on May 4, 2016, in the Chancery Court of the First Judicial District of Harrison County, Mississippi (the \"Court\"), requesting, among other things, foreclosure of the real property described in the Deed of Trust; and WHEREAS, the Court entered its Agreed Judgment, dated July 29, 2016 (\"Agreed Judgment\"), appointing Jeffrey R. Barber as Special Commissioner and directing and authorizing Jeffrey R. Barber, or his authorized agent, to proceed with foreclosure of the real property described in the Deed of Trust; and WHEREAS, default having been made in the performance of the terms and conditions of the Deed of Trust, and the entire indebtedness secured thereby being due and payable pursuant to the terms of the Deed of Trust, and the Court having directed and authorized the undersigned Special Commissioner so to do, I will, on the 28th day of September, 2016, offer for sale at public outcry and sell during legal hours, being between the hours of 11:00 a.m. and 4:00 p.m., at the main east door of the Harrison County Courthouse for the First Judicial District of Harrison County located at 1801 23rd Avenue, Gulfport, Mississippi the following described land and property lying and being situated in Harrison County, Mississippi, and being more particularly described as follows, to-wit: Beginning at the Southwest corner of land formerly owned by P. Michel, on the North margin of Second Street in Block 1, of the Original Town of Long Beach, Harrison County, Mississippi, and running thence North 150 feet to the center of said Block 1; thence running West 60 feet parallel with Second Street; thence running South 150 feet to the North line of said Second Street; thence running East along the North line of Second Street 60 feet to the Point of Beginning. Said property having a frontage of 60 feet on Second Street and running North between parallel lines 150 feet, being the same property bought by Walter Fabian from Michael H. Fabian by Deed recorded in Deed Book 217, Page 535 in the office of the Chancery Clerk of Harrison County, First Judicial District, Mississippi. And being the East 60 feet of Lot 10, Block 1, Original Long Beach, Harrison County, Mississippi. This foreclosure sale will be made subject to (i) 2015 tax sale for 2014 taxes and (ii) 2016 tax sale for 2015 taxes. The sale will be conducted as follows: (1) Jeffrey R. Barber, Special Commissioner, or his authorized agent, shall read the notice of sale. (2) The property shall then be offered for sale. (3) The highest bid received shall control. (4) The sale shall be for cash payable by certified funds, cashier's check or wire transfer to Jeffrey R. Barber, Special Commissioner, unless Whitney Bank, a Mississippi state chartered bank, formerly known as Hancock Bank, a Mississippi state chartered bank, is the successful bidder in which case any bid amount shall be paid as a credit on the outstanding indebtedness due to Whitney Bank, a Mississippi state chartered bank, formerly known as Hancock Bank, a Mississippi state chartered bank, under the Deed of Trust. All funds payable shall be delivered on the day of the sale. (5) All funds received at the sale shall be deposited in the trust account of Jones Walker LLP and be held in such account pending further order of the Court. (6) After the sale, Jeffrey R. Barber, Special Commissioner, shall file with the Court his report of the sale together with the proposed form of the deed and the proposed disbursement of the sale proceeds. Upon review and confirmation, the Court will authorize execution, delivery and recording of the deed and disbursement of the sale proceeds as set forth in the Agreed Judgment. (7) The special commissioner's deed shall convey the property to the successful bidder without warranty of title. (8) Pursuant to the Agreed Judgment, the foreclosure of the Deed of Trust will terminate and cut off the interests of all parties in and to the property described above. WITNESS MY SIGNATURE, this the 31st day of August, 2016. /S/ JEFFREY R. BARBER, SPECIAL COMMISSIONER Jones Walker LLP P. O. Box 427 Jackson, MS 39 205-0427 (601) 949-4900 PUBLISH: September 6, September 13, September 20, and September 27, 2016 1580409\n\t"},
{"page_url": "http://classifieds.sunherald.com/ms/biloxi-foreclosures/substituted-trustees-notice-o/C0A80155144ac03C9EVKx2D549A5", "text": "\n\t\tSUBSTITUTED TRUSTEE'S NOTICE OF SALE WHEREAS, on July 9, 2009, Rhonda Carlson, unmarried, executed a certain deed of trust to Jay Morris, Attorney, Trustee for the benefit of JPMorgan Chase Bank, N.A., which deed of trust is of record in the office of the Chancery Clerk of Harrison County, State of Mississippi in Instrument No. 2009 9676T-J1; and WHEREAS, JPMorgan Chase Bank, National Association has heretofore substituted Shapiro & Massey, LLC as Trustee by instrument dated June 24, 2016 and recorded in the aforesaid Chancery Clerk's Office in Instrument No. 2016 5735 T-J1; and WHEREAS, default having been made in the terms and conditions of said deed of trust and the entire debt secured thereby having been declared to be due and payable in accordance with the terms of said deed of trust, JPMorgan Chase Bank, National Association, the legal holder of said indebtedness, having requested the undersigned Substituted Trustee to execute the trust and sell said land and property in accordance with the terms of said deed of trust and for the purpose of raising the sums due thereunder, together with attorney's fees, trustee's fees and expense of sale. NOW, THEREFORE, I, Shapiro & Massey, LLC, Substituted Trustee in said deed of trust, will on September 22, 2016 offer for sale at public outcry and sell within legal hours (being between the hours of 11:00 a.m. and 4:00 p.m.), at the East Main Door of the County Courthouse of Harrison County, located at Gulfport, Mississippi, to the highest and best bidder for cash the following described property situated in Harrison County, State of Mississippi, to-wit: Unit Number Forty-seven (47), Racquet Club Townhomes, a Condominium according to the official map or plat thereof on file and of record in the office of the Chancery Clerk of the First Judicial District of Harrison County, Mississippi in Plat Book 31 at Page 26 thereof, reference to which is hereby made in aid of and as a part of this description and also a 1/54 the interest in the common areas as per the Condominium Declaration. I WILL CONVEY only such title as vested in me as Substituted Trustee. WITNESS MY SIGNATURE on this 24th day of August, 2016. Shapiro & Massey, LLC SUBSTITUTED TRUSTEE Shapiro & Massey, LLC 1080 River Oaks Drive Suite B-202 Flowood, MS 39232 (601) 981-9299 928 Courthouse Road 47 Gulfport, MS 39507 16-016600BE Publication Dates: August 31, September 7, 14, 21, 2016 1580131\n\t"},
{"page_url": "http://classifieds.sunherald.com/ms/biloxi-foreclosures/substituted-trustees-notice-o/C0A80181142b803C9FHnU1B055C2", "text": "\n\t\tSUBSTITUTED TRUSTEE'S NOTICE OF SALE WHEREAS, on December 14, 2009, Joel Sandig and Sonja Sandig, Husband and Wife executed a certain deed of trust to First American Title, Trustee for the benefit of Mortgage Electronic Registration Systems, Inc., as nominee for PHH Mortgage Corporation, its successors and assigns which deed of trust is of record in the office of the Chancery Clerk of Harrison County, State of Mississippi in Instrument No. 2009 16585T-J1; and WHEREAS, said Deed of Trust was subsequently assigned to PHH Mortgage Corporation by instrument dated June 21, 2016 and recorded in Instrument No. 2016 5555 T-J1 of the aforesaid Chancery Clerk's office; and WHEREAS, PHH Mortgage Corporation has heretofore substituted Shapiro & Massey, LLC as Trustee by instrument dated June 29, 2016 and recorded in the aforesaid Chancery Clerk's Office in Instrument No. 2016 5535 T-J1 and re-recorded in Instrument No. 2016 5927 T-J1; and WHEREAS, default having been made in the terms and conditions of said deed of trust and the entire debt secured thereby having been declared to be due and payable in accordance with the terms of said deed of trust, PHH Mortgage Corporation, the legal holder of said indebtedness, having requested the undersigned Substituted Trustee to execute the trust and sell said land and property in accordance with the terms of said deed of trust and for the purpose of raising the sums due thereunder, together with attorney's fees, trustee's fees and expense of sale. NOW, THEREFORE, I, Shapiro & Massey, LLC, Substituted Trustee in said deed of trust, will on September 23, 2016 offer for sale at public outcry and sell within legal hours (being between the hours of 11:00 a.m. and 4:00 p.m.), at the East Main Door of the County Courthouse of Harrison County, located at Gulfport, Mississippi, to the highest and best bidder for cash the following described property situated in Harrison County, State of Mississippi, to-wit: The following described land and property lying and being situated in the First Judicial District of Harrison County, Mississippi, to-wit: Commence at the SW corner of the SE 1/4 of the NE 1/4 of Section 11, Township 5 South, Range 12 West, Harrison County, Mississippi; thence South 89 degrees 31 minutes 00 seconds East a distance of 474.30 feet to a point; thence South 14 degrees 35 minutes 00 seconds West a distance of 404.6 feet to a point located on the North Right of way of a county paved road; thence South 61 degrees 22 minutes 00 seconds East along said right of way, a distance of 183.40 feet to a point and the true point of beginning; thence South 61 degrees 22 minutes 00 seconds East along said right of way, a distance of 30.00 feet to a point; thence North 00 degrees 35 minutes 00 seconds West, a distance of 489.30 feet to a point; thence South 88 degrees 25 minutes 00 seconds East, a distance of 319.20 feet to a point; thence North 01 degrees 00 minutes 00 seconds East a distance of 212.40 feet to a point; thence North 89 degrees 10 minutes 00 seconds West, a distance of 83.30 feet to a point; thence North 38 degrees 50 minutes 00 seconds west a distance of 339.40 feet to a point; thence North 26 degrees 30 minutes 00 seconds West, a distance of 223.90 feet to a point; thence South 03 degrees 44 minutes 43 seconds East a distance of 670.42 feet to a point; thence South 00 degrees 58 minutes 30 seconds East a distance of 475.50 feet to the point of beginning. The property contains 3.34 acres, more or less and is located in the SE 1/4 of the NE 1/4 and in the NE 1/4 of the SE 1/4 of said Section 11. Commonly known as: 19112 Pete Hickman Road, Saucier, MS 39574. Parcel Number: 0602K-01-021.001 I WILL CONVEY only such title as vested in me as Substituted Trustee. WITNESS MY SIGNATURE on this 15th day of August, 2016. Shapiro & Massey, LLC SUBSTITUTED TRUSTEE Shapiro & Massey, LLC 1080 River Oaks Drive Suite B-202 Flowood, MS 39232 (601) 981-9299 19112 Pete Hickman Road Saucier, MS 39574 16-016027AH Publication Dates: August 26, 2016 and September 2, 9 and 16, 2016 1579943\n\t"},
{"page_url": "http://classifieds.sunherald.com/ms/biloxi-foreclosures/state-of-mississippi-county-of/C0A80154143e403C9BgYR12AEA12", "text": "\n\t\tSTATE OF MISSISSIPPI COUNTY OF JACKSON SUBSTITUTE TRUSTEE'S NOTICE OF SALE WHEREAS, on September 1, 2011, DAVID A. TEW and NATALIE A. TEW executed a Deed of Trust to R.E. Perkins, Jr., Trustee for the benefit of FIRST FEDERAL SAVINGS AND LOAN ASSOCATION OF PASCAGOULA-MOSS POINT, Beneficiary, which Deed of Trust is recorded in Deed of Trust Book 2993 at Page 567, in the Office of the Chancery Clerk of Jackson County, Mississippi; and WHEREAS, FIRST FEDERAL SAVINGS AND LOAN ASSOCATION OF PASCAGOULA-MOSS POINT, the legal holder of said Deed of Trust and the Note secured thereby, substituted SCOTT CORLEW, as Trustee therein, as authorized by the terms thereof, by instrument dated August 18, 2016, and recorded in Deed of Trust Book 3377, Pages 507, on file in the office of the aforesaid Chancery Clerk; and WHEREAS , default having been made in the terms and conditions of said Deed of Trust recorded in Deed of Trust Book 2993, at Page 567, on file in the Office of the aforesaid Chancery Clerk, and the entire debt secured thereby having been declared to be due and payable in accordance with the terms of said Deed of Trust, and the legal holder of said indebtedness, having requested the undersigned Substitute Trustee to execute the trust and sell said land and property in accordance with the terms of said Deed of Trust for the purpose of raising the sums due thereunder, together with attorney's fees, trustee's fees and expenses of sale; NOW, THEREFORE, I, SCOTT CORLEW, Substitute Trustee in said Deed of Trust recorded in Deed of Trust Book 2993, at Page 567, on file in the Office of the aforesaid Chancery Clerk, will on the 20th day of September, A. D., 2016, offer for sale and will sell at public outcry to the highest bidder for cash, within the legal hours (between the hours of 11:00 a.m. and 4:00 p.m.) at the West front door of the Jackson County Courthouse, 3104 Magnolia Street, Pascagoula, Jackson County, Mississippi, the following described property situated and lying in Jackson County, Mississippi , to-wit: A parcel of land situated in the Southeast Quarter (SE 1/4) of Section 12, Township 6 South, Range 7 West, Jackson County, Mississippi, being more particularly described as follows, to-wit: Commencing at a found 3\" diameter pipe that is East 1929.11 feet and North 1086.84 feet from the SW corner of Section 12, said Township and Range; thence run South 89 degrees 42 minutes 17 seconds East 1241.00 feet to a set 1/2\" diameter iron pin; thence run North 00 degrees 13 minutes 26 seconds East 232.89 feet to a set 1/2\" diameter iron pin on the North rightof-way of Faye Lane, Also being the Point of Beginning; thence run North 88 degrees 31 minutes 29 seconds West 219.36 feet along said North right-of-way of said road to a set 1/2\" diameter iron pin; thence run North 00 degrees 13 minutes 26 seconds East 297.94 feet to a set 1/2\" diameter iron pin; thence run South 88 degrees 31 minutes 29 seconds East 219.36 feet to a set 1/2\" diameter iron pin; thence run South 00 degrees 13 minutes 26 seconds West 297.94 feet back to the point of beginning. Containing 1.50 acres, more or less. The above property is a part of the same property conveyed to Allen  R. Tew and wife, Deborah W. Tew, by Corrected Warranty Deed Recorded in Book 949, Page 286 Land Deed Records of Jackson County, Mississippi.  The above property is also the same property conveyed to David A. Tew and Candace R. Andrews by Quitclaim Deed from Allen R. Tew and wife, Deborah W. Tew dated August 21, 2008, and recorded in Book 1551, Pages 595-598, Land Deed Records of Jackson County, Mississippi. I WILL CONVEY only such title as is vested in me as Substitute Trustee. WITNESS MY SIGNATURE, this the day of August, 2016. SCOTT CORLEW Substitute Trustee Posted: 8/22/16 Published: 8/29/16 9/5/16 9/12/16 9/19/16 1580066\n\t"},
{"page_url": "http://classifieds.sunherald.com/ms/biloxi-foreclosures/state-of-mississippi-county-of/C0A80154143e403C9Bjhh12AEA12", "text": "\n\t\tSTATE OF MISSISSIPPI COUNTY OF JACKSON SUBSTITUTE TRUSTEE'S NOTICE OF SALE WHEREAS, on April 10, 2012, CHARLES KYLE MARBLE and JENNIE C. MARBLE executed a Deed of Trust to Larry A. Smith, Trustee for the benefit of FIRST FEDERAL SAVINGS AND LOAN ASSOCATION OF PASCAGOULA-MOSS POINT, Beneficiary, which Deed of Trust is recorded in Deed of Trust Book 3036 at Page 128, in the Office of the Chancery Clerk of Jackson County, Mississippi; and WHEREAS, FIRST FEDERAL SAVINGS AND LOAN ASSOCATION OF PASCAGOULA-MOSS POINT, the legal holder of said Deed of Trust and the Note secured thereby, substi tuted SCOTT CORLEW, as Trustee therein, as authorized by the terms thereof, by instrument dated August 18, 2016 , and recorded in Deed of Trust Book 3377, Page 509, on file in the office of the aforesaid Chancery Clerk; and WHEREAS , default having been made in the terms and conditions of said Deed of Trust recorded in Deed of Trust Book 3036, at Page 128, on file in the Office of the aforesaid Chancery Clerk, and the entire debt secured thereby having been declared to be due and payable in accordance with the terms of said Deed of Trust, and the legal holder of said indebtedness, having requested the undersigned Substitute Trustee to execute the trust and sell said land and property in accordance with the terms of said Deed of Trust for the purpose of raising the sums due thereunder, together with attorney's fees, trustee's fees and expenses of sale; NOW, THEREFORE, I, SCOTT CORLEW, Substitute Trustee in said Deed of Trust recorded in Deed of Trust Book 3036, at Page 128, on file in the Office of the aforesaid Chancery Clerk, will on the 20th day of September , A. D., 2016, offer for sale and will sell at public outcry to the highest bidder for cash, within the legal hours (between the hours of 11:00 a.m. and 4:00 p.m.) at the West front door of the Jackson County Courthouse, 3104 Magnolia Street, Pascagoula, Jackson County, Mississippi, the following described property situated and lying in Jackson County, Mississippi , to-wit: That certain tract, piece or parcel of land situated in the NW 1/4 of Section 12, Township 4 South, Range 6 West, Jackson County, Mississippi, and more particularly described as follows, to wit: Commencing at a found cotton spindle at the NW corner of said Section 12 and run thence South a distance of 796.20 feet; thence run East a distance of 18.59 feet to a set 1/2 inch iron pin on the East right-of-way of Polktown Road, also being the point of beginning. And from said point of beginning thence continue East a distance of 656.67 feet to a set 1/2 inch iron pin; thence run South 00 degrees, 14 minutes 38 seconds West a distance of 331.68 feet to a set 1/2 inch iron pin; thence run West a distance of 656.67 feet to a set 1/2 inch iron pin on the East right-of-way of the aforementioned Polktown Road; thence run North 00 degrees 14 minutes 38 seconds East a distance of 331.68 feet along said right-of-way of said road back to the point of beginning. And being part of the same land conveyed by deed dated September 24, 1988, and recorded in Deed Book 922, Page 491, Land Deed Records of Jackson County, Mississippi. I WILL CONVEY only such title as is vested in me as Substitute Trustee. WITNESS MY SIGNATURE, this the day of August, 2016. SCOTT CORLEW Substitute Trustee Posted: 8/22/16 Published: 8/29/16 9/5/16 9/12/16 9/19/16 1580065\n\t"},
{"page_url": "http://classifieds.sunherald.com/ms/biloxi-foreclosures/state-of-mississippi-county-of/C0A80154143e403C9BJHT12AEA12", "text": "\n\t\tSTATE OF MISSISSIPPI COUNTY OF JACKSON SUBSTITUTE TRUSTEE'S NOTICE OF SALE WHEREAS, on February 6, 2008, SHAUN L. DUNNAM A/K/A SHAUN LONNIE DUNNHAM and HEATHER MARIE DUNNAM executed a Deed of Trust to R.E. Perkins, Jr., Trustee for the benefit of FIRST FEDERAL SAVINGS AND LOAN ASSOCATION OF PASCAGOULA-MOSS POINT, Beneficiary, which Deed of Trust is recorded in Deed of Trust Book 2682 at Page 892, in the Office of the Chancery Clerk of Jackson County, Mississippi; and WHEREAS, FIRST FEDERAL SAVINGS AND LOAN ASSOCATION OF PASCAGOULA-MOSS POINT, the legal holder of said Deed of Trust and the Note secured thereby, substituted SCOTT CORLEW, as Trustee therein, as authorized by the terms thereof, by instrument dated August 18, 2016, and recorded in Deed of Trust Book 3377, Page 505, on file in the office of the aforesaid Chancery Clerk; and WHEREAS , default having been made in the terms and conditions of said Deed of Trust recorded in Deed of Trust Book 2682, at Page 892, on file in the Office of the aforesaid Chancery Clerk, and the entire debt secured thereby having been declared to be due and payable in accordance with the terms of said Deed of Trust, and the legal holder of said indebtedness, having requested the undersigned Substitute Trustee to execute the trust and sell said land and property in accordance with the terms of said Deed of Trust for the purpose of raising the sums due thereunder, together with attorney's fees, trustee's fees and expenses of sale; NOW, THEREFORE, I, SCOTT CORLEW, Substitute Trustee in said Deed of Trust recorded in Deed of Trust Book 2682, at Page 892, on file in the Office of the aforesaid Chancery Clerk, will on the 20th day of September, A. D., 2016, offer for sale and will sell at public outcry to the highest bidder for cash, within the legal hours (between the hours of 11:00 a.m. and 4:00 p.m.) at the West front door of the Jackson County Courthouse, 3104 Magnolia Street, Pascagoula, Jackson County, Mississippi, the following described property situated and lying in Jackson County, Mississippi , to-wit: Lot 6, Block 26, Eastlawn Subdivision, Tract C, as per plat thereof recorded in Plat Book 2, Pages 10-13, Record of Plats on file in the Office of the Chancery Clerk of Jackson County, Mississippi. I WILL CONVEY only such title as is vested in me as Substitute Trustee. WITNESS MY SIGNATURE, this the day of August, 2016. SCOTT CORLEW Substitute Trustee Posted: 8/22/16 Published: 8/29/16 9/5/16  9/12/16 9/19/16 1580064\n\t"},
{"page_url": "http://classifieds.sunherald.com/ms/biloxi-foreclosures/state-of-mississippi-county-of/C0A80154143e403C9BSLw12AEA12", "text": "\n\t\tSTATE OF MISSISSIPPI COUNTY OF JACKSON SUBSTITUTE TRUSTEE'S NOTICE OF SALE WHEREAS, on May 30, 2014, DAVID P. HOFFMAN and ROSEMARIE M. HOFFMAN executed a Deed of Trust to R.E. Perkins, Jr., Trustee for the benefit of FIRST FEDERAL SAVINGS AND LOAN ASSOCATION OF PASCAGOULA-MOSS POINT, Beneficiary, which Deed of Trust is recorded in Deed of Trust Book 3213 at Page 292, in the Office of the Chancery Clerk of Jackson County, Mississippi; and WHEREAS, FIRST FEDERAL SAVINGS AND LOAN ASSOCATION OF PASCAGOULA-MOSS POINT, the legal holder of said Deed of Trust and the Note secured thereby, substituted SCOTT CORLEW, as Trustee therein, as authorized by the terms thereof, by instrument dated August 18, 2016, and recorded in Deed of Trust Book 3377, Page 511, on file in the office of the aforesaid Chancery Clerk; and WHEREAS , default having been made in the terms and conditions of said Deed of Trust recorded in Deed of Trust Book 3213, at Page 292, on file in the Office of the aforesaid Chancery Clerk, and the entire debt secured thereby having been declared to be due and payable in accordance with the terms of said Deed of Trust, and the legal holder of said indebtedness, having requested the undersigned Substitute Trustee to execute the trust and sell said land and property in accordance with the terms of said Deed of Trust for the purpose of raising the sums due thereunder, together with attorney's fees, trustee's fees and expenses of sale; NOW, THEREFORE, I, SCOTT CORLEW, Substitute Trustee in said Deed of Trust recorded in Deed of Trust Book 3213, at Page 292, on file in the Office of the aforesaid Chancery Clerk, will on the 20th day of September, A. D., 2016, offer for sale and will sell at public outcry to the highest bidder for cash, within the legal hours (between the hours of 11:00 a.m. and 4:00 p.m.) at the West front door of the Jackson County Courthouse, 3104 Magnolia Street, Pascagoula, Jackson County, Mississippi, the following described property situated and lying in Jackson County, Mississippi , to-wit: Lot 180, Bienville Place Subdivision, Phase IV, a subdivision, according to a map or plat thereof which is on file of record in the office of the Chancery Clerk of Jackson County, MS, in Plat Book 20 at Page 29, reference to which is hereby made in aid of and as a part of this description. Jackson County Tax Parcel No. 61039180.000 I WILL CONVEY only such title as is vested in me as Substitute Trustee. WITNESS MY SIGNATURE, this the day of August, 2016. SCOTT CORLEW Substitute Trustee Posted: 8/22/16 Published: 8/29/16 9/5/16 9/12/16 9/19/16 1580059\n\t"},
{"page_url": "http://classifieds.sunherald.com/ms/biloxi-foreclosures/state-of-mississippi-county-of/C0A80154143e403C9BStl12AEA12", "text": "\n\t\tSTATE OF MISSISSIPPI COUNTY OF HARRISON FIRST JUDICIAL DISTRICT NOTICE OF SUBSTITUTE TRUSTEE'S SALE OF LAND WHEREAS, Martha L. Cole, President of Hi-Lo Farms, Inc., as Grantor, by Deed of Trust dated November 20, 2014, recorded as Instrument No. 2 014-9629 T-J1 of the Deed of Trust records of the Office of the Chancery Clerk of Harrison County, First Judicial District, Mississippi, conveyed certain property therein described in trust to Jerry D. Riley as Trustee, to secure payment of a certain indebtedness to Daniel R. Fischer, as Beneficiary; and WHEREAS, said Deed of Trust was modified by that certain modification of Deed of Trust dated December 11, 2015 and recorded as Instrument No. 2 015-1093 4T-J1; and WHEREAS, Daniel R. Fischer substituted David A. Wheeler as Substitute Trustee in place and stead of Jerry D. Riley as was his right to do under the terms of said Deed of Trust. Said Substitution of Trustee being dated June 8, 2016 and filed for record in the office of the Chancery Clerk of Harrison County, First Judicial District, Mississippi and recorded as Instrument No. 2 016-4806 T-J1; and, WHEREAS, default having been made in the terms and conditions of the said Deed of Trust and the entire debt secured having been disclosed and payable in accordance of the terms of said Deed of Trust, and the legal holder of said indebtedness, Daniel R. Fischer having requested the undersigned Substitute Trustee to execute the trust and sell said land and property in accordance with the terms of said Deed of Trust for the purpose of raising the sums due thereunder together with attorney's fees and expenses of sale. NOW, THEREFORE, the undersigned Substitute Trustee, pursuant to such authority and the request so made does hereby give notice that he will sell during the legal hours (between the hours of 11:00 a.m. and 4:00 p.m.) on the 20th day of September, 2016, at the east front door of the Harrison County, First Judicial District, Courthouse in Gulfport, Mississippi, for cash to the highest and best bidder, the following described land and property being located and situated in Harrison County, First Judicial District, Mississippi, and being more particularly described as follows, to-wit: A parcel of land situated in the Northeast 1/4 of Section 1, Township 7 South, Range 11 West, Harrison County, Mississippi, and being more particularly described as follows: Commencing at an iron pipe found at that point where the west line of said Northeast 1/4 of Section 1, intersects the south margin of O'Neal Road; thence along said South margin, S 89 degrees 26' 20\" E 330.18' to an iron pipe found; thence S 19 degrees 00' 00\" E 1317.03' to an iron rod found at the POINT OF BEGINNING; thence N 73 degrees 58' 20\" E 322.68' to an iron rod found on the west margin of John Ross Road; thence along said west margin S 21 degrees 43' 56\" E 141.86' to an iron to an iron rod found; thence further along said west margin S 25 degrees 05' 39\" E 154.73' to an iron rod found; thence S 89 degrees 05' 25\" W 408.67' to an iron rod found; thence N 01 degrees 10' 38\" W 139.18' to an iron rod found; thence N 18 degrees 31' 53\" W 52.89' to the POINT OF BEGINNING, containing 1.938 acres. Title to the above described property is believed to be good, but I will convey only such title as is vested in me as Substitute Trustee. WITNESS MY SIGNATURE, this the 23rd day of August, 2016. DAVID A. WHEELER, SUBSTITUTE TRUSTEE Wheeler & Wheeler, PLLC P.O. Box 264 Biloxi, MS 39533 (228) 374-6720 PUBLICATION DATES: 8/29/16; 9/5/16; 9/12/16; 9/19/16 1580070\n\t"},
{"page_url": "http://classifieds.sunherald.com/ms/biloxi-foreclosures/substituted-trustees-notice-o/C0A801541444803C98syx3AF07CD", "text": "\n\t\tSUBSTITUTED TRUSTEE'S NOTICE OF SALE WHEREAS, on the 17th day of August, 2007, George V. Graham, who acquired title as George Vernon Graham, and Alisa R. Graham, husband and wife , executed a certain Deed of Trust dated August 6, 2007 to Charles A. Pringle, Trustee, for the benefit of Administrator, U.S. Small Business Administration, an Agency of the Government of the United States of America, which Deed of Trust was recorded in the office of the Chancery Clerk of Harrison County, Mississippi, and recorded as Instrument No. 2007 18854T-J1 of the land records; and, WHEREAS, T. Frank Collins has been substituted in the place and stead of Charles A. Pringle, Trustee, for the benefit of Administrator, U.S. Small Business Administration, an Agency of the Government of the United States of America, said Appointment of Substitute Trustee being recorded as Instrument No. 2016 6700T-J1 of the records of the Chancery Clerk of said County; and, WHEREAS, fee simple title is vested in George Vernon Graham and wife, Alisa R. Graham; and, WHEREAS, default having been made in the terms and conditions of said Deed of Trust and the entire debt secured thereby having been declared to be due and payable in accordance with the terms of said Deed of Trust, the legal holder of said indebtedness, Administrator, U.S. Small Business Administration, an Agency of the Government of the United States of America, having requested the undersigned Substituted Trustee to execute the trust and sell said land and property in accordance with the terms of said Deed of Trust and for the purpose of raising the sums due thereunder, together with attorney's fees, trustee's fees and expense of sale. NOW, THEREFORE, I, T. Frank Collins, Substituted Trustee in said Deed of Trust, will on the 27th day of September, 2016, offer for sale at public outcry and sell within legal hours (being between the hours of 11:00 a.m. and 4:00 p.m.), at the East Main Front Door of the Harrison County Courthouse, 1801 23rd Avenue, Gulfport, Mississippi to the highest and best bidder for cash the following described property situated in Harrison County, State of Mississippi, to-wit: A PARCEL OF LAND SITUATED AND BEING LOCATED IN THE SW 1/4 OF THE SE 1/4 OF SECTION 19, TOWNSHIP 7 SOUTH, RANGE 12 WEST, AND ALSO BEING SITUATED IN THE NW 1/4 OF THE NE 1/4, SECTION 30, TOWNSHIP 7 SOUTH, RANGE 12 WEST, ALL HARRISON COUNTY, FIRST JUDICIAL DISTRICT, MISSISSIPPI, AND BEING MORE PARTICULARLY DESCRIBED AS FOLLOWS: COMMENCE AT THE SOUTHWEST CORNER OF THE SW 1/4 OF THE SE 1/4 OF SAID SECTION 19, THENCE SOUTH 00 DEGREES 15 MINUTES 13 SECONDS EAST 90.56 FEET; THENCE SOUTH 85 DEGREES 30 MINUTES 30 SECONDS EAST 362.92 FEET; THENCE SOUTH 85 DEGREES 28 MINUTES 10 SECONDS EAST 493.74 FEET; THENCE SOUTH 85 DEGREES 47 MINUTES 10 SECONDS EAST 244.64 FEET TO THE POINT OF BEGINNING; THENCE NORTH 00 DEGREES 04 MINUTES 07 SECONDS WEST 1402.95 FEET TO THE NORTH LINE OF THE SW 1/4 OF THE SE 1/4 OF SECTION 19; THENCE SOUTH 84 DEGREES 57 MINUTES 47 SECONDS EAST 347.76 FEET ALONG SAID NORTH LINE OF SAID SW 1/4 OF THE SE 1/4 TO THE NORTHEAST CORNER OF SAID SW 1/4 OF THE SE 1/4 OF SECTION 19; THENCE SOUTH 00 DEGREES 18 MINUTES 07 SECONDS EAST 621.73 FEET ALONG THE EAST LINE OF SAID SW 1/4 OF THE SE 1/4; THENCE NORTH 84 DEGREES 57 MINUTES 47 SECONDS WEST 315.26 FEET; THENCE SOUTH 00 DEGREES 04 MINUTES 07 SECONDS EAST 780.94 FEET; THENCE NORTH 85 DEGREES 47 MINUTES 10 SECONDS WEST 35.00 FEET TO THE SAID POINT OF BEGINNING. SAID PARCEL OF LAND CONTAINS 5.59 ACRES, MORE OR LESS. LESS AND EXCEPT THE NORTH 25.0 FEET FOR RIGHT-OF-WAY TO MEAUT ROAD. More commonly known as: 23168 Meaut Road, Pass Christian, MS 39571. I WILL CONVEY only such title as is vested in me as Substituted Trustee. WITNESS MY SIGNATURE, this the 23rd day of August, 2016. /s/ T. Frank Collins  T. Frank Collins, Substituted Trustee Prepared By: T. Frank Collins, Esq. Collins & Associates, PLLC 100 Webster Circle, Suite 2 Madison, Mississippi 39110 Telephone: (601) 853-4400 Dates of Publication: August 30, September 6, September 13 and September 20, 2016 1580071\n\t"},
{"page_url": "http://classifieds.sunherald.com/ms/biloxi-foreclosures/substituted-trustees-notice-o/C0A801541444803C98VLm3AF07CD", "text": "\n\t\tSUBSTITUTED TRUSTEE'S NOTICE OF SALE WHEREAS, on July 25, 2008, Cedar Lake Wellness Facility, LLC (\"Cedar Lake\") executed a certain Deed of Trust and Security Agreement and Fixture Financing Statement with Assignment Of Leases and Rents to David A. Wheeler as Trustee for the benefit of Trustmark National Bank (\"Trustmark\") which was recorded on July 29, 2008 in the Real Property Records in the Office of the Chancery Clerk of Harrison County, Second Judicial District, State of Mississippi (the \"Records\") as Instrument #2 008-4096 -T-J2, which was modified by Instrument #2 011-4175 -T-J2 recorded on December 29, 2011, and re-recorded as Instrument #2013-145-T-J2 on January 11, 2013 (the \"4096 Deed of Trust\"); and WHEREAS, Trustmark has heretofore substituted William H. Leech as Trustee in and for the 4096 Deed of Trust in lieu and in place of David A. Wheeler by instrument dated October 7, 2015, and recorded in the Records on October 13, 2015, as Instrument #2 015-3225 -T-J2; and WHEREAS, on July 25, 2008, Cedar Lake executed a certain Deed of Trust and Security Agreement and Fixture Financing Statement with Assignment Of Leases and Rents to David A. Wheeler as Trustee for the benefit of Trustmark and was joined by Enlightened Fitness and Wellness, Inc. (\"Enlightened Fitness\") which was recorded on July 29, 2008 in the Records as Instrument #2 008-4103 -T-J2 (the \"4103 Deed of Trust\"); and WHEREAS, Trustmark has heretofore substituted William H. Leech as Trustee in and for the 4103 Deed of Trust in lieu and in place of David A. Wheeler by instrument dated October 7, 2015, and recorded in the Records on October 13, 2015, as Instrument #2 015-3226 -T-J2; and WHEREAS, default having been made under the terms and conditions of the 4096 Deed of Trust and the 4103 Deed of Trust (together, the \"Deeds of Trust\") and all of the indebtedness secured thereby having been declared to be due and payable in accordance with the terms of the Deeds of Trust, Trustmark, the legal holder of the Deeds of Trust and the indebtedness secured thereby, has requested the undersigned Substituted Trustee, William H. Leech, to execute the trusts and sell the land, property, and all fixtures subject thereto in accordance with the terms of the Deeds of Trust for the purpose of raising the sums due, together with attorney's fees, Substituted Trustee's fees, and expenses of sale. NOW, THEREFORE, I, William H. Leech, Substituted Trustee in the Deeds of Trust, will on Thursday, September 22, 2016, offer for sale at public outcry and sell within legal hours (being between the hours of 11:00 a.m. and 4:00 p.m.) at the South front door of the County Courthouse of Harrison County, Second Judicial District, located at 730 Dr. Martin Luther King Jr. Boulevard, in the City of Biloxi, County of Harrison, State of Mississippi, to the highest and best bidder for cash, the following described property situated in Harrison County, Mississippi (the \"Property\"), to-wit: Lot 1; CEDAR LAKE WELLNESS SUBDIVISION, a subdivision located in Section 13, Township 7 South, Range 10 West and in Section 18, Township 7 South, Range 9 West, City of Biloxi, Second Judicial District, Harrison County, Mississippi as per map or plat thereof on file and of record in Plat Book 28 at Pages 1-2. THE ABOVE PROPERTY BEING PREVIOUSLY DESCRIBED BY METES AND BOUNDS AS FOLLOWS AND BEING THE IDENTICAL PROPERTY TO THAT DESCRIBED IN THE DEED OF TRUST RECORDED AS INSTRUMENT NO. 2008-4096T-J2. A parcel of land situated in the Northeast Quarter of the Southeast Quarter of Section 13, Township 7 South, Range 10 West, City of Biloxi, Second Judicial District, Harrison County, Mississippi, being more particularly described as follows, to-wit: Commence at the Southeast corner of the Northeast Quarter of the Southeast Quarter of said Section 13; thence North 89 degrees 58'46\" West 1377.63 feet to the East margin of Wells Drive; thence North 0 degrees 07'54\" West, along said East margin of 381.96 feet; thence South 45 degrees 06' 40\" East 56.63 feet to the North margin of A.J. Holloway Drive; thence East along said North margin 597.89 feet to the POINT OF BEGINNING; thence North 101.05 feet; thence West 144.71 feet; thence North 18 degrees 00'00\" West 97.78 feet; thence South 72 degrees 00' 00\" West 5.75 feet; thence North 18 degrees 00' 00\" West 116.85 feet; thence South 71 degrees 45' 52\" West 24.13 feet; thence North 18 degrees 14' 08\" West 108.04 feet, thence North 135.23 feet; thence North 71 degrees 45' 52\" East 292.77 feet; thence South 18 degrees 00' 00\" East 35.53 feet; thence North 71 degrees 45' 52\" East 147.81 feet; thence South 18 degrees 14' 08\" East 452.87 feet; thence South 207.63 feet to the North margin of A.J. Holloway Drive; thence West along said North margin 297.88 feet to the POINT OF BEGINNING. TOGETHER WITH A NONEXCLUSIVE EASEMENT FOR INGRESS, EGRESS, PARKING AND UTILITIES AND OTHER MATTERS AS MORE FULLY SET FORTH IN THE INSTRUMENT RECORDED AS INSTRUMENT NO. 2 008-1026 D-J2 and re-recorded as Instrument No. 2 008-1330 D-J2, over, across and on the following described property, being a portion of Lot 2, CEDAR LAKE WELLNESS SUBDIVISION, a subdivision located in Section 13, Township 7 South, Range 10 West and in Section 18, Township 7 South, Range 9 West, City of Biloxi, Second Judicial District, Harrison County, Mississippi as per map or plat thereof on file and of record in Plat Book 28 at Pages 1-2. Previously described by metes and bounds as follows: Commencing at the Southeast corner of the Northeast 1/4 of the Southeast 1/4 of Section 13, Township 7 South, Range 10 West, City of Biloxi, Harrison County, Mississippi; thence run North 89 degrees 58' 46\" West a distance of 1377.63 feet to a point on the East margin of Wells Drive; thence run North 00 degrees 07'54\" West, along said East margin, a distance of 832.48 feet to the POINT OF BEGINNING; thence continue North 00 degrees 07'54\" West, along said East margin, a distance of 60.00 feet; thence run on a bearing of East a distance of 146.46 feet to a point; thence run on a bearing of North a distance of 172.50 feet to a point; thence run on a bearing of East a distance of 282.50 feet to a point; thence run North 18 degrees 14'08\" West a distance of 54.26 feet to a point; thence run North 49 degrees 20'30\" West a distance of 121.18 feet to a point; thence run North 07 degrees 19'01\" West a distance of 20.00 feet to a point on the Southern margin of Richards Drive; thence run Easterly, along said Southern margin of Richards Drive, along a curve, being concave to North, a distance of 100 feet, more or less, to a point, said curve having a chord bearing North 83 degrees 12'39\" East 100.00 feet from the previous point; thence run South 07 degrees 19'01\" East a distance of 40.00 feet to a point; thence run South 35 degrees 27'39\" East a distance of 62.05 feet to a point; thence run South 18 degrees 14'08\" East a distance of 93.43 feet to a point; thence run North 71 degrees 45'52\" East a distance of 246.87 feet to a point; thence run South 19 degrees 10'01\" East a distance of 161.44 feet to a point; thence run South 71 degrees 45'52\" West a distance of 125.94 feet to a point; thence run North 18 degrees 00'00\" West a distance of 35.53 feet to a point; thence run South 71 degrees 45'52\" West a distance of 292.77 feet to a point; thence run a bearing of South a distance of 107.71 feet to a point; thence run on a bearing of West a distance of 125.86 feet to a point; thence run on a bearing of North a distance of 64.50 feet to a point; thence run a bearing of West a distance of 239.95 feet to the POINT OF BEGINNING. AND ALSO Commencing at said Southeast corner of the Northeast 1/4 of the Southeast 1/4 of Section 13; thence run North 89 degrees 58'46\" West a distance of 1377.63 feet to a point on the East margin of Wells Drive; thence run North 00 degrees 07'54\" West, along said East margin, a distance of 341.99 feet to a point at the intersection of the East margin of Wells Drive and the extension of the North margin of the new A.J. Holloway Drive; thence run on a bearing of East, along said North margin of A.J. Holloway Drive and extension thereof, a distance of 520.67 feet to a point; thence run on a bearing of North a distance of 18.50 feet to the POINT OF BEGINNING; thence continue on a bearing of North a distance of 82.55 feet to a point; thence run on a bearing of East a distance of 117.25 feet to a point; thence run on a bearing of South a distance of 82.55 feet to a point; thence run on a bearing of West a distance of 117.25 feet to the POINT OF BEGINNING. INDEXING INSTRUCTIONS: Northeast Quarter of the Southeast Quarter of Section 13, Township 7 South, Range 10 West, City of Biloxi, Second Judicial District, Harrison County, Mississippi AND Northwest Quarter of the Southwest Quarter and the Southwest Quarter of the Southwest Quarter, all in Section 18, Township 7 South, Range 9 West, City of Biloxi, Harrison County, Mississippi I WILL CONVEY only such title as is vested in me as Substituted Trustee. WITNESS MY SIGNATURE, this the 25th day of August, 2016. /s/ William H. Leech WILLIAM H. LEECH SUBSTITUTED TRUSTEE Publication Dates: August 30, 2016, September 6, 2016, September 13, 2016, and September 20, 2016. Prepared by: William H. Leech, MSB No. 1175 COPELAND, COOK, TAYLOR & BUSH, P.A. 1076 Highland Colony Parkway 600 Concourse, Suite 100 Ridgeland, MS 39157 (601) 856-7200 1580135\n\t"}
]